msed-manual.org
#+TITLE: Medley Sound editor V1.0 manual
#+SUBTITLE: a product of trial and error, and lots of reverse enginerding
#+AUTHOR: Lauri "Archyx" Lindholm
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]

* Medley Sound editor V1.0 manual

Medley Sound is the software that was used to make the background
music for the Imploder 4.0.  The two songs used in it were called
"Plodemusic" and "requester deun", the first one being the main theme
tune and latter was the tune that played after the file implosion was
done and the save requester was shown.  The Meter Test feature in the
score editor was for fine tuning the meters in Imploder 4.0 to wiggle
with the theme tune.

This manual is a creation based on a lot of experimentation and a lot
more reverse engineering of the Medley Sound player routine and the
editor.  All of this was written because the original complete source
code and whatever documentation there had been was partially lost
prior to Paul releasing what little was left of this historical
software.

The editor doesn't have a very polished interface and plenty of the
values for various parameters just have to be known.  This manual is
an attempt to document these various parameters and their functional
values to make the editor useful once again.

In July 2024 the internal data structures of the executable programs
were split out of the editor manual as the file size started to grow.
They can now be found from a separate document in the repository.


** Some common commands and data input schemes

The different parts of the editor share certain common commands and
data input schemes.  The typical commands are as follows:

|-------------+------------------------------------------------|
| ~c~         | Change (or select) instrument/score/track/wave |
| ~r~         | Rename instrument/score/track/wave             |
| Shift + ~K~ | Delete ("kill")                                |
| Shift + ~N~ | Allocate new                                   |
| <SPC>       | Notes off / stop                               |
| <ESC>       | Cancel input/operation, exit editor            |
| Ctrl + ~L~  | Switch hardware low-pass filter on/off ("LED") |
| Ctrl + ~V~  | Open supervisor console                        |
|-------------+------------------------------------------------|

Not all of these commands work in every editor, but most do.

One thing to keep in mind is that the editor is designed to be used
with the default ~us~ keymap.


*** Number entry

A typical single-byte number entry uses the typewriter keyboard to
input individual hexadecimal numbers.  The current number in the
single digit position is pushed into tens and the number in tens is
discarded.  The ~1~ to ~9~ on the numpad are used in a special way to
modify the existing hex number:

+-----+-----+-----+-----+
|  [  |  ]  |  /  |  *  |
+-----+-----+-----+-----+
| -10 | $ff | +10 |  -  |
+-----+-----+-----+-----+
|  -4 | $80 |  +4 |  +  |
+-----+-----+-----+-----+
|  -1 | $00 |  +1 |  E  |
+-----+-----+-----+  n  |
|    0      |  .  |  t  |
+-----------+-----+-----+


** Supervisor

The editor features a "Supervisor" console from which certain
statistics can be viewed.  It also features optimising tools to delete
unused tracks, instruments, and waves to reduce memory footprint.

However, at least some of these optimising tools have logic flaws
which render the tools useless in their current implementation and may
cause deletion of all tracks/instruments/waves instead of just the
unused ones.

The score optimiser can potentially corrupt memory in addition to
plain clearing the score table without freeing the allocated memory.


