msed-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-14 Sun 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Medley Sound editor V1.0 manual</title>
<meta name="author" content="Lauri &quot;Archyx&quot; Lindholm" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Medley Sound editor V1.0 manual
<br />
<span class="subtitle">a product of trial and error, and lots of reverse enginerding</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc71a7a0">1. Medley Sound editor V1.0 manual</a>
<ul>
<li><a href="#org629822a">1.1. Some common commands and data input schemes</a>
<ul>
<li><a href="#org7ce04a9">1.1.1. Number entry</a></li>
</ul>
</li>
<li><a href="#orgd76ff41">1.2. Supervisor</a>
<ul>
<li><a href="#org0c19ce6">1.2.1. <code>i</code> – info</a></li>
<li><a href="#org498898d">1.2.2. <code>l</code> – list</a></li>
<li><a href="#org9dd6411">1.2.3. <code>m</code> and <code>v</code> – monitor and view</a></li>
<li><a href="#org9383c8e">1.2.4. <code>o</code> – optimise</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org462d8cf">2. Main Menu</a>
<ul>
<li><a href="#org4757da3">2.1. (m) Medley Editor</a></li>
<li><a href="#orgcae8a33">2.2. (s) Score Editor</a></li>
<li><a href="#org79afd3c">2.3. (t) Track Editor</a></li>
<li><a href="#org8acd2c4">2.4. (i) Instrument Editor</a></li>
<li><a href="#orge4c5cf2">2.5. (w) Wave Editor</a></li>
<li><a href="#org6715f5a">2.6. (c) Chord Editor</a></li>
<li><a href="#org07c5782">2.7. (f) File Menu</a></li>
<li><a href="#org1e73e9a">2.8. (Q) Quit</a></li>
</ul>
</li>
<li><a href="#orgdba285c">3. Score Editor</a>
<ul>
<li><a href="#org11d8f26">3.1. Keyboard commands</a></li>
<li><a href="#orgf98bb4e">3.2. Flanger</a>
<ul>
<li><a href="#org4a2d6c9">3.2.1. Flanger algorithms</a></li>
</ul>
</li>
<li><a href="#org05c93bb">3.3. <span class="todo TODO">TODO</span> Sound effects</a></li>
</ul>
</li>
<li><a href="#org37462a5">4. Track Editor</a>
<ul>
<li><a href="#org98bce35">4.1. Keboard commands</a>
<ul>
<li><a href="#org7f7d65d">4.1.1. Editing modes</a></li>
<li><a href="#orgfa3a4bb">4.1.2. Insert and edit mode functions</a></li>
</ul>
</li>
<li><a href="#orgce68e83">4.2. Note editing and SCODEs</a>
<ul>
<li><a href="#org227f0dc">4.2.1. Notes ($00..$7f)</a></li>
<li><a href="#org17ecc31">4.2.2. SCODEs ($80..$8f)</a></li>
</ul>
</li>
<li><a href="#org168d2a2">4.3. Important DO NOTs:</a></li>
</ul>
</li>
<li><a href="#org576724c">5. Instrument Editor</a>
<ul>
<li><a href="#org6397e66">5.1. SND</a>
<ul>
<li><a href="#orgf9ff0bd">5.1.1. a:Mo - sound mode</a></li>
<li><a href="#org951ede0">5.1.2. b:Wa - wave</a></li>
<li><a href="#orgafd52c0">5.1.3. c:Bs - Base shift <code>&lt;bsm&gt;</code></a></li>
<li><a href="#org86b9b68">5.1.4. d:Ds - Dynamic shift <code>&lt;dyn&gt;</code></a></li>
<li><a href="#org5ad3580">5.1.5. e:Tr - transpose</a></li>
<li><a href="#org10b1c82">5.1.6. f:Fq - Dynamic frequency <code>&lt;dyn&gt;</code></a></li>
</ul>
</li>
<li><a href="#org8022007">5.2. ENV - Envelope Generator</a>
<ul>
<li><a href="#org1710caa">5.2.1. a:Tr - (unused?)</a></li>
<li><a href="#orge52e18f">5.2.2. b:At - Attack time</a></li>
<li><a href="#org3cfa5d9">5.2.3. c:Tl - Peak level (Top level)</a></li>
<li><a href="#org20c3cfb">5.2.4. d:Dt - Decay time</a></li>
<li><a href="#org215f18e">5.2.5. e:Sl - Sustain level</a></li>
<li><a href="#orgd531fe5">5.2.6. f:Rt - Release Time</a></li>
</ul>
</li>
<li><a href="#org31b27b7">5.3. MG - Modulation Generator</a>
<ul>
<li><a href="#orge92f4cf">5.3.1. a:De - Destination</a></li>
<li><a href="#org8096a45">5.3.2. b:Bl - Block wave (boolean, $00 = off)</a></li>
<li><a href="#org86221f1">5.3.3. c:Tr - Trigger mode (boolean, $00 = trigger at every note-on)</a></li>
<li><a href="#orgf2a2462">5.3.4. d:Ss - Single-shot (boolean, $00 = off)</a></li>
<li><a href="#orga8e43b4">5.3.5. e:Sg - (unused)</a></li>
<li><a href="#org9acba2f">5.3.6. f:Rv - Reverse (boolean, $00 = off)</a></li>
<li><a href="#org1b6ba3f">5.3.7. g:Dt - Delay time</a></li>
<li><a href="#org6706266">5.3.8. h:Lv - Level</a></li>
<li><a href="#orgf9e0372">5.3.9. i:S1 / j:S2 - Slope 1 / Slope 2</a></li>
<li><a href="#org1109850">5.3.10. k:Hs / l:Qs - Half-shift / Quarter-shift</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org07144d9">6. Wave Editor</a>
<ul>
<li><a href="#orgdd896cf">6.1. Frags</a></li>
<li><a href="#orge51f9e9">6.2. Operations</a>
<ul>
<li><a href="#orgc64451a">6.2.1. a:SX – shift source A left in samples</a></li>
<li><a href="#org3467bd5">6.2.2. b:SY – shift source A down (add a fixed value to each sample)</a></li>
<li><a href="#orgf7ddede">6.2.3. c:AM – amplitude (10 = no change)</a></li>
<li><a href="#org712d3ce">6.2.4. d:FQ – frequency of source A (10 = no change)</a></li>
<li><a href="#org01e84d9">6.2.5. e:MX – mix sources (00 = A; ff = B; 80 will mix 50/50)</a></li>
<li><a href="#orgd3b5d2a">6.2.6. f:RE - Adjust Result buffer length</a></li>
<li><a href="#org5602251">6.2.7. g:UF</a></li>
<li><a href="#orgdf2c837">6.2.8. h:PE – playback period (higher value = lower frequency)</a></li>
</ul>
</li>
<li><a href="#org0e2faa9">6.3. Preset - generate waveforms</a>
<ul>
<li><a href="#org05b796c">6.3.1. a:RA - generate a saw/triangle wave</a></li>
<li><a href="#org64f3a8c">6.3.2. b:PU - generate a pulse/square wave</a></li>
<li><a href="#org6102bfb">6.3.3. s - precalculated sine wave</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3598ca7">7. File Menu</a>
<ul>
<li><a href="#org60ff46e">7.1. (l)oad, (m)erge, and (i)mport</a></li>
<li><a href="#orgc043851">7.2. (s)ave</a></li>
<li><a href="#org2f12a75">7.3. &lt;a&gt;ssembly</a></li>
<li><a href="#org6caf9bf">7.4. (C)lear</a></li>
</ul>
</li>
<li><a href="#orgda83f36">8. msed patches</a>
<ul>
<li><a href="#org217a817">8.1. Track editor: semitone up</a></li>
<li><a href="#org2b9c596">8.2. Supervisor: optimise scores</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc71a7a0" class="outline-2">
<h2 id="orgc71a7a0"><span class="section-number-2">1.</span> Medley Sound editor V1.0 manual</h2>
<div class="outline-text-2" id="text-1">
<p>
Medley Sound is the software that was used to make the background
music for the Imploder 4.0.  The two songs used in it were called
"Plodemusic" and "requester deun", the first one being the main theme
tune and latter was the tune that played after the file implosion was
done and the save requester was shown.  The Meter Test feature in the
score editor was for fine tuning the meters in Imploder 4.0 to wiggle
with the theme tune.
</p>

<p>
This manual is a creation based on a lot of experimentation and a lot
more reverse engineering of the Medley Sound player routine and the
editor.  All of this was written because the original complete source
code and whatever documentation there had been was partially lost
prior to Paul releasing what little was left of this historical
software.
</p>

<p>
The editor doesn't have a very polished interface and plenty of the
values for various parameters just have to be known.  This manual is
an attempt to document these various parameters and their functional
values to make the editor useful once again.
</p>

<p>
In July 2024 the internal data structures of the executable programs
were split out of the editor manual as the file size started to grow.
They can now be found from a separate document in the repository.
</p>
</div>


<div id="outline-container-org629822a" class="outline-3">
<h3 id="org629822a"><span class="section-number-3">1.1.</span> Some common commands and data input schemes</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The different parts of the editor share certain common commands and
data input schemes.  The typical commands are as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Change (or select) instrument/score/track/wave</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">Rename instrument/score/track/wave</td>
</tr>

<tr>
<td class="org-left">Shift + <code>K</code></td>
<td class="org-left">Delete ("kill")</td>
</tr>

<tr>
<td class="org-left">Shift + <code>N</code></td>
<td class="org-left">Allocate new</td>
</tr>

<tr>
<td class="org-left">&lt;SPC&gt;</td>
<td class="org-left">Notes off / stop</td>
</tr>

<tr>
<td class="org-left">&lt;ESC&gt;</td>
<td class="org-left">Cancel input/operation, exit editor</td>
</tr>

<tr>
<td class="org-left">Ctrl + <code>L</code></td>
<td class="org-left">Switch hardware low-pass filter on/off ("LED")</td>
</tr>

<tr>
<td class="org-left">Ctrl + <code>V</code></td>
<td class="org-left">Open supervisor console</td>
</tr>
</tbody>
</table>

<p>
Not all of these commands work in every editor, but most do.
</p>

<p>
One thing to keep in mind is that the editor is designed to be used
with the default <code>us</code> keymap.
</p>
</div>


<div id="outline-container-org7ce04a9" class="outline-4">
<h4 id="org7ce04a9"><span class="section-number-4">1.1.1.</span> Number entry</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
A typical single-byte number entry uses the typewriter keyboard to
input individual hexadecimal numbers.  The current number in the
single digit position is pushed into tens and the number in tens is
discarded.  The <code>1</code> to <code>9</code> on the numpad are used in a special way to
modify the existing hex number:
</p>

<!-- This HTML table template is generated by emacs 29.4 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;[&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;]&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;/&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;*&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;-10&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;$ff&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;+10&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;-&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;-4&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;$80&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;+4&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;+&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;-1&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;$00&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;+1&nbsp;
    </td>
    <td rowspan="2" align="left" valign="top">
      &nbsp;&nbsp;E&nbsp;&nbsp;<br />
      &nbsp;&nbsp;n&nbsp;&nbsp;<br />
      &nbsp;&nbsp;t&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td colspan="2" align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;0&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;.&nbsp;&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
</div>


<div id="outline-container-orgd76ff41" class="outline-3">
<h3 id="orgd76ff41"><span class="section-number-3">1.2.</span> Supervisor</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The editor features a "Supervisor" console from which certain
statistics can be viewed.  It also features optimising tools to delete
unused tracks, instruments, and waves to reduce memory footprint.
</p>

<p>
However, at least some of these optimising tools have logic flaws
which render the tools useless in their current implementation and may
cause deletion of all tracks/instruments/waves instead of just the
unused ones.
</p>

<p>
The score optimiser can potentially corrupt memory in addition to
plain clearing the score table without freeing the allocated memory.
</p>
</div>
