msed-manual.org
*** ~i~ – info

Shows basic information about the current song in memory.


*** ~l~ – list

This command is used to list allocated instruments, scores, tracks, or
waves in the Supervisor console.  ~l~ alone does nothing.  See table
below.

|------+----------------------|
| ~li~ | List instruments     |
| ~ls~ | List scores          |
| ~lt~ | List tracks          |
| ~lw~ | List waves (samples) |
|------+----------------------|


*** ~m~ and ~v~ – monitor and view

Monitor and View are basically the same thing. The difference is that
View displays a single frame of player status while Monitor refreshes
the status display continuously.

: Enable ff   Flang Algo 03  Flang Speed 06  Volume 3f
:
: 0:on   C..3  02  ins 09 dbass2           Vol 3f
: 1:on   C..2  2b  ins 06 Carrilon         Vol 3f
: 2:on   C..3  42  ins 09 dbass2           Vol 31
: 3:on   E..2  06  ins 09 Snaredrum        Vol 3f

The first line shows player interrupt status, flanger algorithm and
speed, and the song volume.

The data shown for each channel is channel status (~on~ or ~off~), the
note, the play time of the note left, the instrument number and name,
and volume.


*** ~o~ – optimise

These commmands are used to clean up unused song parts before
exporting the song into assembly source.

Since these functions can be very unreliable, it's preferred to use an
external tool to convert a PVMS project selectively into an MSOB.
This document contains all the information needed to create such a
tool.


**** ~os~ – Optimise scores

**Do not use!** This feature is broken!  Initially it looked like it
might write to undefined memory, but it still uses an uninitialised
counter.  The executable should be patched first for this function to
operate correctly.

The intention of score optimisation is to move all allocated scores
one after another into a contiguous list.  Due to a bug that
initialises an incorrect register instead of the one used for the
counter, this function might not scan through the whole score table.


**** ~oa~ - Optimise all

Performs the following optimisations in order:

1. Optimise tracks.
2. Optimise instruments.
3. Optimise waves.


**** ~ot~ - Optimise tracks

Scans through all tracks used in scores and any tracks used by tracks
used in scores and deletes all the tracks not referenced to.


**** ~oi~ – Optimise instruments

Scans through all scores and tracks for any used instruments and
deletes any instruments not used.


**** ~ow~ – Optimise waves

Scans through all instruments and deletes all unused waves.


* Main Menu

** (m) Medley Editor

The Medley Editor is not implemented.


** (s) Score Editor

The Score Editor is used to define the four tracks and other
parameters that make each of 255 possible songs, $1..$ff.


** (t) Track Editor

The Track Editor is used to create and edit tracks, the maximum number
of them being 255, $1..$ff.  Tracks are pieces of single channel note
and control data and run independently from each other.  Proper timing
of tracks between channels is solely left to the song programmer,
which allows great flexibility to reuse tracks efficiently.


** (i) Instrument Editor

The Instrument Editor is used to define instrument parameters.  There
can be a maximum number of 255 instruments, $1..$ff, each using 1 to 8
waves defined by an octave table, a single volume envelope generator,
and four modulation generators.  Three operating modes are available
to produce sounds from plain samples to complex dynamic synthesis.


** (w) Wave Editor

The Wave Editor is also known as the Sample Editor.  The Wave Editor
has facilities to generate pulse and triangle/saw waves, or a
precalculated sine wave, and an operation mode to edit and mix waves
together.


** (c) Chord Editor

The Chord Editor is not implemented.  It could be speculated that the
intention was to create an arpeggiator similar to the Future Player
implementation.


** (f) File Menu

The File Menu offers the usual project loading and saving as well as a
special option to export the song as an assembly language source code.
Assembling the source will produce a Medley Sound Object, or MSOB, for
use with the standalone player.


** (Q) Quit

To quit Medley Sound Editor you must press ~Shift + Q~.  If you press
just ~q~, the editor will show "Say what?" on the window title.
Pressing ~Esc~ will instruct "Shift-Q to Quit" in the window title.


* Score Editor

The Score Editor defines the starting tracks of the song played on the
four channels.  See Track Editor and the TRACK command to figure out
how to nest tracks to make a song out of multiple tracks.

A starting track, a default instrument, FxBase, FxRnd, and channel
volume are defined for each channel.  FxBase and FxRnd are discussed
further in a following section.  The channel volume appears to be a
non-functional variable.

*Note!* If you have song repeat enabled, the player routine will
become stuck in an endless loop if a starting track on any channel
contains no notes or only zero-length notes.  This will freeze the
whole computer!

Setting volumes and other score variables is typically not boundary
checked, which means the song programmer needs to take care that the
variables are within functional limits, eg. volumes are between 0 and
$3f.


