msed-manual.html


<div id="outline-container-org0c19ce6" class="outline-4">
<h4 id="org0c19ce6"><span class="section-number-4">1.2.1.</span> <code>i</code> – info</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Shows basic information about the current song in memory.
</p>
</div>
</div>


<div id="outline-container-org498898d" class="outline-4">
<h4 id="org498898d"><span class="section-number-4">1.2.2.</span> <code>l</code> – list</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
This command is used to list allocated instruments, scores, tracks, or
waves in the Supervisor console.  <code>l</code> alone does nothing.  See table
below.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>li</code></td>
<td class="org-left">List instruments</td>
</tr>

<tr>
<td class="org-left"><code>ls</code></td>
<td class="org-left">List scores</td>
</tr>

<tr>
<td class="org-left"><code>lt</code></td>
<td class="org-left">List tracks</td>
</tr>

<tr>
<td class="org-left"><code>lw</code></td>
<td class="org-left">List waves (samples)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org9dd6411" class="outline-4">
<h4 id="org9dd6411"><span class="section-number-4">1.2.3.</span> <code>m</code> and <code>v</code> – monitor and view</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Monitor and View are basically the same thing. The difference is that
View displays a single frame of player status while Monitor refreshes
the status display continuously.
</p>

<pre class="example">
Enable ff   Flang Algo 03  Flang Speed 06  Volume 3f

0:on   C..3  02  ins 09 dbass2           Vol 3f
1:on   C..2  2b  ins 06 Carrilon         Vol 3f
2:on   C..3  42  ins 09 dbass2           Vol 31
3:on   E..2  06  ins 09 Snaredrum        Vol 3f
</pre>


<p>
The first line shows player interrupt status, flanger algorithm and
speed, and the song volume.
</p>

<p>
The data shown for each channel is channel status (<code>on</code> or <code>off</code>), the
note, the play time of the note left, the instrument number and name,
and volume.
</p>
</div>
</div>


<div id="outline-container-org9383c8e" class="outline-4">
<h4 id="org9383c8e"><span class="section-number-4">1.2.4.</span> <code>o</code> – optimise</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
These commmands are used to clean up unused song parts before
exporting the song into assembly source.
</p>

<p>
Since these functions can be very unreliable, it's preferred to use an
external tool to convert a PVMS project selectively into an MSOB.
This document contains all the information needed to create such a
tool.
</p>
</div>


<ol class="org-ol">
<li><a id="orge334a91"></a><code>os</code> – Optimise scores<br />
<div class="outline-text-5" id="text-1-2-4-1">
<p>
<b><b>Do not use!</b></b> This feature is broken!  Initially it looked like it
might write to undefined memory, but it still uses an uninitialised
counter.  The executable should be patched first for this function to
operate correctly.
</p>

<p>
The intention of score optimisation is to move all allocated scores
one after another into a contiguous list.  Due to a bug that
initialises an incorrect register instead of the one used for the
counter, this function might not scan through the whole score table.
</p>
</div>
</li>


<li><a id="org8866248"></a><code>oa</code> - Optimise all<br />
<div class="outline-text-5" id="text-1-2-4-2">
<p>
Performs the following optimisations in order:
</p>

<ol class="org-ol">
<li>Optimise tracks.</li>
<li>Optimise instruments.</li>
<li>Optimise waves.</li>
</ol>
</div>
</li>


<li><a id="org48a2fed"></a><code>ot</code> - Optimise tracks<br />
<div class="outline-text-5" id="text-1-2-4-3">
<p>
Scans through all tracks used in scores and any tracks used by tracks
used in scores and deletes all the tracks not referenced to.
</p>
</div>
</li>


<li><a id="orgf9a1547"></a><code>oi</code> – Optimise instruments<br />
<div class="outline-text-5" id="text-1-2-4-4">
<p>
Scans through all scores and tracks for any used instruments and
deletes any instruments not used.
</p>
</div>
</li>


<li><a id="org35826f7"></a><code>ow</code> – Optimise waves<br />
<div class="outline-text-5" id="text-1-2-4-5">
<p>
Scans through all instruments and deletes all unused waves.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org462d8cf" class="outline-2">
<h2 id="org462d8cf"><span class="section-number-2">2.</span> Main Menu</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4757da3" class="outline-3">
<h3 id="org4757da3"><span class="section-number-3">2.1.</span> (m) Medley Editor</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The Medley Editor is not implemented.
</p>
</div>
</div>


<div id="outline-container-orgcae8a33" class="outline-3">
<h3 id="orgcae8a33"><span class="section-number-3">2.2.</span> (s) Score Editor</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The Score Editor is used to define the four tracks and other
parameters that make each of 255 possible songs, $1..$ff.
</p>
</div>
</div>


<div id="outline-container-org79afd3c" class="outline-3">
<h3 id="org79afd3c"><span class="section-number-3">2.3.</span> (t) Track Editor</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The Track Editor is used to create and edit tracks, the maximum number
of them being 255, $1..$ff.  Tracks are pieces of single channel note
and control data and run independently from each other.  Proper timing
of tracks between channels is solely left to the song programmer,
which allows great flexibility to reuse tracks efficiently.
</p>
</div>
</div>


<div id="outline-container-org8acd2c4" class="outline-3">
<h3 id="org8acd2c4"><span class="section-number-3">2.4.</span> (i) Instrument Editor</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The Instrument Editor is used to define instrument parameters.  There
can be a maximum number of 255 instruments, $1..$ff, each using 1 to 8
waves defined by an octave table, a single volume envelope generator,
and four modulation generators.  Three operating modes are available
to produce sounds from plain samples to complex dynamic synthesis.
</p>
</div>
</div>


<div id="outline-container-orge4c5cf2" class="outline-3">
<h3 id="orge4c5cf2"><span class="section-number-3">2.5.</span> (w) Wave Editor</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The Wave Editor is also known as the Sample Editor.  The Wave Editor
has facilities to generate pulse and triangle/saw waves, or a
precalculated sine wave, and an operation mode to edit and mix waves
together.
</p>
</div>
</div>


<div id="outline-container-org6715f5a" class="outline-3">
<h3 id="org6715f5a"><span class="section-number-3">2.6.</span> (c) Chord Editor</h3>
<div class="outline-text-3" id="text-2-6">
<p>
The Chord Editor is not implemented.  It could be speculated that the
intention was to create an arpeggiator similar to the Future Player
implementation.
</p>
</div>
</div>


<div id="outline-container-org07c5782" class="outline-3">
<h3 id="org07c5782"><span class="section-number-3">2.7.</span> (f) File Menu</h3>
<div class="outline-text-3" id="text-2-7">
<p>
The File Menu offers the usual project loading and saving as well as a
special option to export the song as an assembly language source code.
Assembling the source will produce a Medley Sound Object, or MSOB, for
use with the standalone player.
</p>
</div>
</div>


<div id="outline-container-org1e73e9a" class="outline-3">
<h3 id="org1e73e9a"><span class="section-number-3">2.8.</span> (Q) Quit</h3>
<div class="outline-text-3" id="text-2-8">
<p>
To quit Medley Sound Editor you must press <code>Shift + Q</code>.  If you press
just <code>q</code>, the editor will show "Say what?" on the window title.
Pressing <code>Esc</code> will instruct "Shift-Q to Quit" in the window title.
</p>
</div>
</div>
</div>


<div id="outline-container-orgdba285c" class="outline-2">
<h2 id="orgdba285c"><span class="section-number-2">3.</span> Score Editor</h2>
<div class="outline-text-2" id="text-3">
<p>
The Score Editor defines the starting tracks of the song played on the
four channels.  See Track Editor and the TRACK command to figure out
how to nest tracks to make a song out of multiple tracks.
</p>

<p>
A starting track, a default instrument, FxBase, FxRnd, and channel
volume are defined for each channel.  FxBase and FxRnd are discussed
further in a following section.  The channel volume appears to be a
non-functional variable.
</p>

<p>
<b>Note!</b> If you have song repeat enabled, the player routine will
become stuck in an endless loop if a starting track on any channel
contains no notes or only zero-length notes.  This will freeze the
whole computer!
</p>

<p>
Setting volumes and other score variables is typically not boundary
checked, which means the song programmer needs to take care that the
variables are within functional limits, eg. volumes are between 0 and
$3f.
</p>
</div>
