msed-manual.org
** Keyboard commands

|-------------+------------------------------------------------------------------|
| <space>     | Stop playing                                                     |
| ~1~ .. ~4~  | Select channel                                                   |
| ~=~         | Fast forward ("Advance")                                         |
| ~a~         | Set Fl. Algo ([[se_flalgo][flanger algorithm]], $01..$05, or $00 = off)         |
| ~b~         | Set FxBase, see [[se_fx][Sound effects]]                                    |
| ~c~         | Change score                                                     |
| ~d~         | Set default instrument (Def. Ins)                                |
| Shift + ~D~ | Go to Instrument Editor, edit default instrument                 |
| ~h~         | Set Tempo Hi                                                     |
| ~i~         | Set instrument (on selected channel)                             |
| Shift + ~I~ | Go to Instrument Editor, edit instrument set on selected channel |
| Shift + ~K~ | Delete score                                                     |
| ~l~         | Set Tempo Lo                                                     |
| ~m~         | Meter test (nothing to see unless a song is playing)             |
| ~n~         | Set FxRnd, see [[se_fx][Sound effects]]                                     |
| Shift + ~N~ | Allocate new score                                               |
| ~o~         | Set Transpose                                                    |
| ~p~         | Play song                                                        |
| Shift + ~P~ | Play From:                                                       |
| ~r~         | Rename score                                                     |
| Shift + ~R~ | Set song repeat (boolean, $00 = off, $ff = on)                   |
| ~s~         | Set Fl. Speed                                                    |
| ~t~         | Set track on selected channel                                    |
| Shift + ~T~ | Go to Track Editor, edit track set on selected channel           |
| ~u~         | Set Upd Reduc                                                    |
| Shift + ~U~ | Unchord (useful mainly with tracks imported from SMUS files)     |
| ~v~         | Set channel volume (Not implemented in the player!)              |
| Shift + ~V~ | Set song volume                                                  |
| Shift + ~X~ | Exchange tracks with secondary track set                         |
|-------------+------------------------------------------------------------------|

Notes:

- Secondary tracks are not used by the player.  (Or it's something for
  the "Medley" feature that was never implemented.)

- The Meter Test shows a mockup of Imploder 4.0 meters on top of the
  score editor.  The drum instrument numbers are hardcoded against
  preset meter deflections.  Other meter modes calculate deflection
  dynamically from a combination of note and note duration.

  The two meters on the left are channels 1 and 4, the middle meter is
  a combined "level" meter, and the two meters on the right are
  channels 2 and 3.


** Flanger

The flanger effect is implemented as changing channel detunes.  To
enable the flanger effect the Flang Speed and Flang Algorithm must be
set non-zero.  The Flang Speed is defined as an initial countdown
value, ie. higher values deliver a slower effect.

The flanger update is performed in the player interrupt code which
makes the Flang Speed definition be "update every nth interrupt
trigger", which also makes it relative to tempo.


*** <<se_flalgo>>Flanger algorithms

The five flanger algorithms are defined in the player routine as
follows:

|------+------+------+------+------|
| alg# | ch 0 | ch 1 | ch 2 | ch 3 |
|------+------+------+------+------|
|    1 |   +1 |   +1 |   ±0 |   ±0 |
|      |   ±0 |   ±0 |   +1 |   +1 |
|------+------+------+------+------|
|    2 |   ±0 |   +1 |   +2 |   -1 |
|      |   +1 |   ±0 |   -1 |   +2 |
|------+------+------+------+------|
|    3 |   ±0 |   +1 |   +2 |   -1 |
|      |   +1 |   +2 |   -1 |   ±0 |
|      |   +2 |   -1 |   ±0 |   +1 |
|      |   -1 |   ±0 |   +1 |   +2 |
|------+------+------+------+------|
|    4 |   ±0 |   ±0 |   -2 |   +2 |
|      |   +1 |   -1 |   -1 |   +1 |
|      |   +2 |   -2 |   ±0 |   ±0 |
|      |   +1 |   -1 |   -1 |   +1 |
|------+------+------+------+------|
|    5 |   -2 |   -1 |   ±0 |   +1 |
|      |   -1 |   ±0 |   +1 |   +2 |
|      |   ±0 |   +1 |   +2 |   -1 |
|      |   +1 |   +2 |   -1 |   -2 |
|------+------+------+------+------|

The algorithms are always defined as a multiple of four bytes, one for
each channel.  Setting the algorithm 0 or beyond 5 will disable the
effect.


** TODO <<se_fx>>Sound effects

Medley Sound was designed for game music and sound effects, so there
naturally is support for the sound effects in the music player.
FxBase ("effect time base") and FxRnd (channel stealing time
randomisation) are used to select sound channels for sound effects as
well as randomising the "channel stealing" and how long a channel is
kept "stolen".  In Future Player the single sound effect channel was
fixed and required constructing the music around this limitation.

This feature requires more research.  For plain music playing the Fx
parameters should be set to 0.


* Track Editor

** Keboard commands

