msed-manual.html


<div id="outline-container-org11d8f26" class="outline-3">
<h3 id="org11d8f26"><span class="section-number-3">3.1.</span> Keyboard commands</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">&lt;space&gt;</td>
<td class="org-left">Stop playing</td>
</tr>

<tr>
<td class="org-left"><code>1</code> .. <code>4</code></td>
<td class="org-left">Select channel</td>
</tr>

<tr>
<td class="org-left"><code>=</code></td>
<td class="org-left">Fast forward ("Advance")</td>
</tr>

<tr>
<td class="org-left"><code>a</code></td>
<td class="org-left">Set Fl. Algo (<a href="#orgf9ac273">flanger algorithm</a>, $01..$05, or $00 = off)</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left">Set FxBase, see <a href="#org2c37247">Sound effects</a></td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Change score</td>
</tr>

<tr>
<td class="org-left"><code>d</code></td>
<td class="org-left">Set default instrument (Def. Ins)</td>
</tr>

<tr>
<td class="org-left">Shift + <code>D</code></td>
<td class="org-left">Go to Instrument Editor, edit default instrument</td>
</tr>

<tr>
<td class="org-left"><code>h</code></td>
<td class="org-left">Set Tempo Hi</td>
</tr>

<tr>
<td class="org-left"><code>i</code></td>
<td class="org-left">Set instrument (on selected channel)</td>
</tr>

<tr>
<td class="org-left">Shift + <code>I</code></td>
<td class="org-left">Go to Instrument Editor, edit instrument set on selected channel</td>
</tr>

<tr>
<td class="org-left">Shift + <code>K</code></td>
<td class="org-left">Delete score</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left">Set Tempo Lo</td>
</tr>

<tr>
<td class="org-left"><code>m</code></td>
<td class="org-left">Meter test (nothing to see unless a song is playing)</td>
</tr>

<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left">Set FxRnd, see <a href="#org2c37247">Sound effects</a></td>
</tr>

<tr>
<td class="org-left">Shift + <code>N</code></td>
<td class="org-left">Allocate new score</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">Set Transpose</td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left">Play song</td>
</tr>

<tr>
<td class="org-left">Shift + <code>P</code></td>
<td class="org-left">Play From:</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">Rename score</td>
</tr>

<tr>
<td class="org-left">Shift + <code>R</code></td>
<td class="org-left">Set song repeat (boolean, $00 = off, $ff = on)</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left">Set Fl. Speed</td>
</tr>

<tr>
<td class="org-left"><code>t</code></td>
<td class="org-left">Set track on selected channel</td>
</tr>

<tr>
<td class="org-left">Shift + <code>T</code></td>
<td class="org-left">Go to Track Editor, edit track set on selected channel</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">Set Upd Reduc</td>
</tr>

<tr>
<td class="org-left">Shift + <code>U</code></td>
<td class="org-left">Unchord (useful mainly with tracks imported from SMUS files)</td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left">Set channel volume (Not implemented in the player!)</td>
</tr>

<tr>
<td class="org-left">Shift + <code>V</code></td>
<td class="org-left">Set song volume</td>
</tr>

<tr>
<td class="org-left">Shift + <code>X</code></td>
<td class="org-left">Exchange tracks with secondary track set</td>
</tr>
</tbody>
</table>

<p>
Notes:
</p>

<ul class="org-ul">
<li>Secondary tracks are not used by the player.  (Or it's something for
the "Medley" feature that was never implemented.)</li>

<li><p>
The Meter Test shows a mockup of Imploder 4.0 meters on top of the
score editor.  The drum instrument numbers are hardcoded against
preset meter deflections.  Other meter modes calculate deflection
dynamically from a combination of note and note duration.
</p>

<p>
The two meters on the left are channels 1 and 4, the middle meter is
a combined "level" meter, and the two meters on the right are
channels 2 and 3.
</p></li>
</ul>
</div>
</div>


<div id="outline-container-orgf98bb4e" class="outline-3">
<h3 id="orgf98bb4e"><span class="section-number-3">3.2.</span> Flanger</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The flanger effect is implemented as changing channel detunes.  To
enable the flanger effect the Flang Speed and Flang Algorithm must be
set non-zero.  The Flang Speed is defined as an initial countdown
value, ie. higher values deliver a slower effect.
</p>

<p>
The flanger update is performed in the player interrupt code which
makes the Flang Speed definition be "update every nth interrupt
trigger", which also makes it relative to tempo.
</p>
</div>


<div id="outline-container-org4a2d6c9" class="outline-4">
<h4 id="org4a2d6c9"><span class="section-number-4">3.2.1.</span> <a id="orgf9ac273"></a>Flanger algorithms</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The five flanger algorithms are defined in the player routine as
follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">alg#</th>
<th scope="col" class="org-right">ch 0</th>
<th scope="col" class="org-right">ch 1</th>
<th scope="col" class="org-right">ch 2</th>
<th scope="col" class="org-right">ch 3</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">+1</td>
<td class="org-right">+1</td>
<td class="org-right">±0</td>
<td class="org-right">±0</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">±0</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+1</td>
<td class="org-right">±0</td>
<td class="org-right">-1</td>
<td class="org-right">+2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
<td class="org-right">±0</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">-1</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">4</td>
<td class="org-right">±0</td>
<td class="org-right">±0</td>
<td class="org-right">-2</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+1</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+2</td>
<td class="org-right">-2</td>
<td class="org-right">±0</td>
<td class="org-right">±0</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+1</td>
<td class="org-right">-1</td>
<td class="org-right">-1</td>
<td class="org-right">+1</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-right">-2</td>
<td class="org-right">-1</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">-1</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">±0</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">+1</td>
<td class="org-right">+2</td>
<td class="org-right">-1</td>
<td class="org-right">-2</td>
</tr>
</tbody>
</table>

<p>
The algorithms are always defined as a multiple of four bytes, one for
each channel.  Setting the algorithm 0 or beyond 5 will disable the
effect.
</p>
</div>
</div>
</div>


<div id="outline-container-org05c93bb" class="outline-3">
<h3 id="org05c93bb"><span class="section-number-3">3.3.</span> <span class="todo TODO">TODO</span> <a id="org2c37247"></a>Sound effects</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Medley Sound was designed for game music and sound effects, so there
naturally is support for the sound effects in the music player.
FxBase ("effect time base") and FxRnd (channel stealing time
randomisation) are used to select sound channels for sound effects as
well as randomising the "channel stealing" and how long a channel is
kept "stolen".  In Future Player the single sound effect channel was
fixed and required constructing the music around this limitation.
</p>

<p>
This feature requires more research.  For plain music playing the Fx
parameters should be set to 0.
</p>
</div>
</div>
</div>


<div id="outline-container-org37462a5" class="outline-2">
<h2 id="org37462a5"><span class="section-number-2">4.</span> Track Editor</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org98bce35" class="outline-3">
<h3 id="org98bce35"><span class="section-number-3">4.1.</span> Keboard commands</h3>
<div class="outline-text-3" id="text-4-1">
</div>
