msed-manual.org
*** Editing modes

|-------------+------------------------|
| Shift + ~D~ | Edit Duration          |
| Shift + ~E~ | Edit Tone and Duration |
| Shift + ~I~ | Insert Mode            |
| Shift + ~L~ | List Mode              |
| Shift + ~T~ | Edit Tone              |
|-------------+------------------------|

The set editing mode of a track persists for the track over track
changes and will also be saved into the project file.  Remember to
change a track back to *List Mode* when you're done editing to avoid
accidental edits!


*** Insert and edit mode functions

|------------------+--------------------------------------------------------|
| Return           | add line below (in insert mode)                        |
| Shift + Return   | insert line above (in insert mode)                     |
| ~a~ .. ~g~       | set note                                               |
| ~1~ .. ~9~       | set octave for note                                    |
| ~`~ (back-quote) | tie note (an asterisk shown before the note)           |
| ~!~              | [[te_TSIGN][TSIGN]] – set time signature (editor feature)            |
| ~@~              | [[te_DYNLV][DYNLV]] – set volume                                     |
| ~#~              | [[te_INSTR][INSTR]] – set instrument                                 |
| ~$~              | [[te_UDATA][UDATA]] – jump to a random track                         |
| ~%~              | [[te_TRACK][TRACK]] – "gosub" to a track                             |
| ~^~              | [[te_RPEAT][RPEAT]] – set start of a loop and loop count             |
| ~&~              | [[te_LOOP][LOOP]] – jump back to a loop start                       |
| ~*~              | [[te_TRANSP][TRANSP]] – transpose up or down in semitones             |
| ~+~              | ~++++~                                                 |
| ~_~ (underscore) | rest ~----~                                            |
| ~-~              | semitone down                                          |
| ~=  ('+')~       | semitone up (buggy sanity-check, don't go beyond B-9!) |
| ~t~              | Trace mode (see notes below)                           |
| Amiga + ~b~      | Set block                                              |
| Amiga + ~c~      | Copy block                                             |
| Amiga + ~i~      | Insert block                                           |
| Amiga + ~k~      | Kill line to buffer                                    |
| Amiga + ~l~      | Yank line from buffer                                  |
| Amiga + ~x~      | Cut block                                              |
| Home (numpad)    | Page up                                                |
| End (numpad)     | Page down                                              |
| Shift + Home     | Go to start of track                                   |
| Shift + End      | Go to end of track                                     |
|------------------+--------------------------------------------------------|

Track navigation is performed using the numpad instead of cursor keys.

Trace mode only works on tracks playing on channel one.  That means
you can't "trace" any other channel while playing a whole score.
Tracing is also rather choppy, so it doesn't work as a real-time
visual view like the pattern view of ProTracker.


** Note editing and SCODEs

Each line of a track represents a note and its length or a control
code (SCODE, most likely from Dutch "stuurcode") and its operand.


*** Notes ($00..$7f)

Notes are defined starting from ~C-1~ ($02 in track data) up to ~B-9~
($6d).  ~----~ ($00) is a rest that triggers ADSR release phase and
~++++~ ($01) is a non-implemented feature.

The operand for a note or a rest is its length, up to $7f.  Bit 7 of
the operand specifies a tied note, ie. inhibit retriggering of the
envelopes or modulation generator(s).  Tying notes together allows a
theoretical infinite note length.

When using the beat and bar signs of the track editor, note length of
$60 will match a whole note.  See [[te_TSIGN][TSIGN]] to adjust time signature.

| note      | length | dotted | triplet |
|-----------+--------+--------+---------|
| whole     | $60    |        |         |
| half      | $30    | $48    | $20     |
| quarter   | $18    | $24    | $10     |
| eighth    | $0c    | $12    | $08     |
| sixteenth | $06    | $09    | $04     |
| 1/32      | $03    |        | $02     |

Comparing to ProTracker patterns at VBlank speed 6, the timing is as
follows:

: ___PT___    ___ Medley Sound ___
: dec  hex    note length
:
:  00 = 00 == $00
:  01   01    $06   sixteenth
:  02   02    $0c   eighth
:  03   03    $12   dotted eighth
:  04 - 04 -- $18 - quarter
:  05   05    $1e
:  06   06    $24   dotted quarter
:  07   07    $2a
:  08 - 08 -- $30 - half
:  09   09    $36
:  10   0A    $3c
:  11   0B    $42
:  12 - 0C -- $48 - dotted half
:  13   0D    $4e
:  14   0E    $54
:  15   0F    $5a
:  16 = 10 == $60 = whole
:  17   11    $66
:  18   12    $6c
:  19   13    $72
:  20 - 14 -- $78
:  21   15    $7e


*** SCODEs ($80..$8f)

The control commands are internally known as SCODEs.  The existing
implementation of the player has a jump table for control codes from
$80 to $8f.  Setting a control code beyond $8f will cause the player
routine to jump to an undefined memory location.


**** $80 [end]

The unmodifyable SCODE is $80 and it's strictly reserved to end a
track.  The operand (always $00) is discarded by the player.

Track nesting table is checked at the track end and replay is resumed
from the calling track, if any.  If there is no track to return to,
song repeat flag is checked and if true, the track restarts.


