msed-manual.html
<div id="outline-container-org7f7d65d" class="outline-4">
<h4 id="org7f7d65d"><span class="section-number-4">4.1.1.</span> Editing modes</h4>
<div class="outline-text-4" id="text-4-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Shift + <code>D</code></td>
<td class="org-left">Edit Duration</td>
</tr>

<tr>
<td class="org-left">Shift + <code>E</code></td>
<td class="org-left">Edit Tone and Duration</td>
</tr>

<tr>
<td class="org-left">Shift + <code>I</code></td>
<td class="org-left">Insert Mode</td>
</tr>

<tr>
<td class="org-left">Shift + <code>L</code></td>
<td class="org-left">List Mode</td>
</tr>

<tr>
<td class="org-left">Shift + <code>T</code></td>
<td class="org-left">Edit Tone</td>
</tr>
</tbody>
</table>

<p>
The set editing mode of a track persists for the track over track
changes and will also be saved into the project file.  Remember to
change a track back to <b>List Mode</b> when you're done editing to avoid
accidental edits!
</p>
</div>
</div>


<div id="outline-container-orgfa3a4bb" class="outline-4">
<h4 id="orgfa3a4bb"><span class="section-number-4">4.1.2.</span> Insert and edit mode functions</h4>
<div class="outline-text-4" id="text-4-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Return</td>
<td class="org-left">add line below (in insert mode)</td>
</tr>

<tr>
<td class="org-left">Shift + Return</td>
<td class="org-left">insert line above (in insert mode)</td>
</tr>

<tr>
<td class="org-left"><code>a</code> .. <code>g</code></td>
<td class="org-left">set note</td>
</tr>

<tr>
<td class="org-left"><code>1</code> .. <code>9</code></td>
<td class="org-left">set octave for note</td>
</tr>

<tr>
<td class="org-left"><code>`</code> (back-quote)</td>
<td class="org-left">tie note (an asterisk shown before the note)</td>
</tr>

<tr>
<td class="org-left"><code>!</code></td>
<td class="org-left"><a href="#orgd655a3a">TSIGN</a> – set time signature (editor feature)</td>
</tr>

<tr>
<td class="org-left"><code>@</code></td>
<td class="org-left"><a href="#orgf7310df">DYNLV</a> – set volume</td>
</tr>

<tr>
<td class="org-left"><code>#</code></td>
<td class="org-left"><a href="#orgef002cc">INSTR</a> – set instrument</td>
</tr>

<tr>
<td class="org-left"><code>$</code></td>
<td class="org-left"><a href="#orgdee22c3">UDATA</a> – jump to a random track</td>
</tr>

<tr>
<td class="org-left"><code>%</code></td>
<td class="org-left"><a href="#orgc0e20e7">TRACK</a> – "gosub" to a track</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left"><a href="#orgbfe50c1">RPEAT</a> – set start of a loop and loop count</td>
</tr>

<tr>
<td class="org-left"><code>&amp;</code></td>
<td class="org-left"><a href="#orgd2440d4">LOOP</a> – jump back to a loop start</td>
</tr>

<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left"><a href="#orgf469b78">TRANSP</a> – transpose up or down in semitones</td>
</tr>

<tr>
<td class="org-left"><code>+</code></td>
<td class="org-left"><code>++++</code></td>
</tr>

<tr>
<td class="org-left"><code>_</code> (underscore)</td>
<td class="org-left">rest <code>----</code></td>
</tr>

<tr>
<td class="org-left"><code>-</code></td>
<td class="org-left">semitone down</td>
</tr>

<tr>
<td class="org-left"><code>=  ('+')</code></td>
<td class="org-left">semitone up (buggy sanity-check, don't go beyond B-9!)</td>
</tr>

<tr>
<td class="org-left"><code>t</code></td>
<td class="org-left">Trace mode (see notes below)</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>b</code></td>
<td class="org-left">Set block</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>c</code></td>
<td class="org-left">Copy block</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>i</code></td>
<td class="org-left">Insert block</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>k</code></td>
<td class="org-left">Kill line to buffer</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>l</code></td>
<td class="org-left">Yank line from buffer</td>
</tr>

<tr>
<td class="org-left">Amiga + <code>x</code></td>
<td class="org-left">Cut block</td>
</tr>

<tr>
<td class="org-left">Home (numpad)</td>
<td class="org-left">Page up</td>
</tr>

<tr>
<td class="org-left">End (numpad)</td>
<td class="org-left">Page down</td>
</tr>

<tr>
<td class="org-left">Shift + Home</td>
<td class="org-left">Go to start of track</td>
</tr>

<tr>
<td class="org-left">Shift + End</td>
<td class="org-left">Go to end of track</td>
</tr>
</tbody>
</table>

<p>
Track navigation is performed using the numpad instead of cursor keys.
</p>

<p>
Trace mode only works on tracks playing on channel one.  That means
you can't "trace" any other channel while playing a whole score.
Tracing is also rather choppy, so it doesn't work as a real-time
visual view like the pattern view of ProTracker.
</p>
</div>
</div>
</div>


<div id="outline-container-orgce68e83" class="outline-3">
<h3 id="orgce68e83"><span class="section-number-3">4.2.</span> Note editing and SCODEs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Each line of a track represents a note and its length or a control
code (SCODE, most likely from Dutch "stuurcode") and its operand.
</p>
</div>


<div id="outline-container-org227f0dc" class="outline-4">
<h4 id="org227f0dc"><span class="section-number-4">4.2.1.</span> Notes ($00..$7f)</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Notes are defined starting from <code>C-1</code> ($02 in track data) up to <code>B-9</code>
($6d).  <code>----</code> ($00) is a rest that triggers ADSR release phase and
<code>++++</code> ($01) is a non-implemented feature.
</p>

<p>
The operand for a note or a rest is its length, up to $7f.  Bit 7 of
the operand specifies a tied note, ie. inhibit retriggering of the
envelopes or modulation generator(s).  Tying notes together allows a
theoretical infinite note length.
</p>

<p>
When using the beat and bar signs of the track editor, note length of
$60 will match a whole note.  See <a href="#orgd655a3a">TSIGN</a> to adjust time signature.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">note</th>
<th scope="col" class="org-left">length</th>
<th scope="col" class="org-left">dotted</th>
<th scope="col" class="org-left">triplet</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">whole</td>
<td class="org-left">$60</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">half</td>
<td class="org-left">$30</td>
<td class="org-left">$48</td>
<td class="org-left">$20</td>
</tr>

<tr>
<td class="org-left">quarter</td>
<td class="org-left">$18</td>
<td class="org-left">$24</td>
<td class="org-left">$10</td>
</tr>

<tr>
<td class="org-left">eighth</td>
<td class="org-left">$0c</td>
<td class="org-left">$12</td>
<td class="org-left">$08</td>
</tr>

<tr>
<td class="org-left">sixteenth</td>
<td class="org-left">$06</td>
<td class="org-left">$09</td>
<td class="org-left">$04</td>
</tr>

<tr>
<td class="org-left">1/32</td>
<td class="org-left">$03</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">$02</td>
</tr>
</tbody>
</table>

<p>
Comparing to ProTracker patterns at VBlank speed 6, the timing is as
follows:
</p>

<pre class="example">
___PT___    ___ Medley Sound ___
dec  hex    note length

 00 = 00 == $00
 01   01    $06   sixteenth
 02   02    $0c   eighth
 03   03    $12   dotted eighth
 04 - 04 -- $18 - quarter
 05   05    $1e
 06   06    $24   dotted quarter
 07   07    $2a
 08 - 08 -- $30 - half
 09   09    $36
 10   0A    $3c
 11   0B    $42
 12 - 0C -- $48 - dotted half
 13   0D    $4e
 14   0E    $54
 15   0F    $5a
 16 = 10 == $60 = whole
 17   11    $66
 18   12    $6c
 19   13    $72
 20 - 14 -- $78
 21   15    $7e
</pre>
</div>
</div>


<div id="outline-container-org17ecc31" class="outline-4">
<h4 id="org17ecc31"><span class="section-number-4">4.2.2.</span> SCODEs ($80..$8f)</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
The control commands are internally known as SCODEs.  The existing
implementation of the player has a jump table for control codes from
$80 to $8f.  Setting a control code beyond $8f will cause the player
routine to jump to an undefined memory location.
</p>
</div>


<ol class="org-ol">
<li><a id="orgc12b901"></a>$80 [end]<br />
<div class="outline-text-5" id="text-4-2-2-1">
<p>
The unmodifyable SCODE is $80 and it's strictly reserved to end a
track.  The operand (always $00) is discarded by the player.
</p>

<p>
Track nesting table is checked at the track end and replay is resumed
from the calling track, if any.  If there is no track to return to,
song repeat flag is checked and if true, the track restarts.
</p>
</div>
</li>
