msed-manual.org
**** <<te_TSIGN>>$81 TSIGN

This SCODE is ignored by the player.  It exists solely to make the
beat and bar indicators in the track editor functional.  The beat/bar
indicators don't handle TRACK commands which may break the beat count
when other tracks are called within the track.

The operand is 5+3 bit designation for the time signature.  The lower
three bits designate the length of the beat and the upper five bits
the count.  See table below.

+-----+-------+---+------+-----+
| $00 | x/1   |   | $00  | 1/x |
| $01 | x/2   |   | $08  | 2/x |
| $02 | x/4   |   | $10  | 3/x |
| $03 | x/8   |   | $18  | 4/x |
| $04 | x/16  |   | $20  | 5/x |
| $05 | x/32  |   | $28  | 6/x |
| $06 | x/64  |   | $30  | 7/x |
| $07 | x/128 |   | etc. |     |
+-----+-------+---+------+-----+

To set up the time signature 4/4, you'd take $18 from the right side
and add $02 from the left side, $18 + $02 = $1a.

For 6/8 the numbers would be $28 + $03 = $2b.

**Note!** 1/128 ($07) is known to crash the editor!


**** <<te_DYNLV>>$82 DYNLV

This sets the channel volume ("dynamic level").  The operand is
specified between $00 and $7f.  The replay routine will divide this by
two (with logical bitwise shift to right) and discard the least
significant bit.


**** <<te_INSTR>>$83 INSTR

Set instrument on current track. This should be rather
self-explanatory.


**** <<te_UDATA>>$84 UDATA

Note!  The implementation of UDATA is broken in the standalone Medley
Sound Player (msplay)!  Msplay's UDATA handler performs address
displacement calculation incorrectly and jumps to an arbitrary
location in track data.

The name of this SCODE isn't very clear regarding its function.  This
one is used to pick a random track from a specified number of
following TRACK lines.  Use of this SCODE must be carefully considered
because the replay routine doesn't sanity check the following track
data and the editor doesn't prevent entering non-functional data.

The operand should be a power of two, ie. $02, $04, $08, $10, $20,
$40, or $80.  Using any other value is not of use due to how the SCODE
handler is written.

This is how to use UDATA:

|------+-----------------+----------------------------|
| data | in track editor | description                |
|------+-----------------+----------------------------|
| 8404 | UDATA  04       | line count following UDATA |
| 8511 | TRACK  11       | first line                 |
| 8512 | TRACK  12       | second line                |
| 8513 | TRACK  13       | third line                 |
| 8514 | TRACK  14       | fourth line                |
|------+-----------------+----------------------------|

UDATA doesn't affect track nesting the way ordinary use of TRACK does.
This is because the actual SCODE of the lines following UDATA is
ignored, only the operand is used, and when valid the player continues
from the selected track without modification to the nesting tables.

This also means that any lines beyond will be ignored unless an
undefined track is specified.  In case of an undefined track, UDATA
returns as if the operand was $00 and the player continues processing
the following lines in order.

Using UDATA within RPEAT/LOOP can also provide unexpected behaviour as
LOOP will return to playing from the track where the RPEAT originally
was!  However, with careful design this feature can also be used to
create eg. drum tracks with pseudo-randomised fills at the ends.

Since Medley Sound no longer has Future Player's dedicated "jump to
track" command, UDATA can also be used to replace it by using UDATA
with operand $01:

|------+----------------------+-------------|
| data | track data in editor | description |
|------+----------------------+-------------|
| 8401 | UDATA  01            | jump to     |
| 8511 | TRACK  11            | track 11    |
|------+----------------------+-------------|


**** <<te_TRACK>>$85 TRACK

Go to track specified by the operand.  This command is used to nest
tracks to make a complex song.  Up to eight nested track calls can be
made per channel.  At full nesting any following TRACK commands will
be ignored.

The player routine will simply skip undefined tracks.

A "return from track" is automatically performed at the track end
code.


**** <<te_RPEAT>>$86 RPEAT and <<te_LOOP>>$87 LOOP

These two are used to create loops within tracks.  Up to eight nested
loops can be used per channel.

The loop is initiated by RPEAT command with the loop count as its
operand.  The loop starting point is the next line of the track from
which the player will keep playing until LOOP command is encountered.
LOOP will decrease the loop counter by one and jump back to the loop
starting point until the loop counter reaches zero.  The operand of
LOOP is ignored.


**** <<te_TRANSP>>$88 TRNSP

This is used to set the transposition byte of the channel.  It's a
signed value, so anything from $80 to $ff is considered a two's
complement, ie. $ff = -1, $fe = -2, etc.

The transposition is defined in semitones.


** Important DO NOTs:

- Do not set the time signature to 1/128 ($07).  The editor will
  freeze if you do so and there are any notes on the following lines.

- Do no use the "halftone up" command ('=') to set notes beyond B-9.
  You'll eventually reach the end code after 'F-;' and the editor will
  freeze if the track is playing while editing.


