msed-manual.html


<li><a id="org334fc41"></a><a id="orgd655a3a"></a>$81 TSIGN<br />
<div class="outline-text-5" id="text-4-2-2-2">
<p>
This SCODE is ignored by the player.  It exists solely to make the
beat and bar indicators in the track editor functional.  The beat/bar
indicators don't handle TRACK commands which may break the beat count
when other tracks are called within the track.
</p>

<p>
The operand is 5+3 bit designation for the time signature.  The lower
three bits designate the length of the beat and the upper five bits
the count.  See table below.
</p>

<!-- This HTML table template is generated by emacs 29.4 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;$00&nbsp;<br />
      &nbsp;$01&nbsp;<br />
      &nbsp;$02&nbsp;<br />
      &nbsp;$03&nbsp;<br />
      &nbsp;$04&nbsp;<br />
      &nbsp;$05&nbsp;<br />
      &nbsp;$06&nbsp;<br />
      &nbsp;$07&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;x/1&nbsp;&nbsp;&nbsp;<br />
      &nbsp;x/2&nbsp;&nbsp;&nbsp;<br />
      &nbsp;x/4&nbsp;&nbsp;&nbsp;<br />
      &nbsp;x/8&nbsp;&nbsp;&nbsp;<br />
      &nbsp;x/16&nbsp;&nbsp;<br />
      &nbsp;x/32&nbsp;&nbsp;<br />
      &nbsp;x/64&nbsp;&nbsp;<br />
      &nbsp;x/128&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;$00&nbsp;&nbsp;<br />
      &nbsp;$08&nbsp;&nbsp;<br />
      &nbsp;$10&nbsp;&nbsp;<br />
      &nbsp;$18&nbsp;&nbsp;<br />
      &nbsp;$20&nbsp;&nbsp;<br />
      &nbsp;$28&nbsp;&nbsp;<br />
      &nbsp;$30&nbsp;&nbsp;<br />
      &nbsp;etc.&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;1/x&nbsp;<br />
      &nbsp;2/x&nbsp;<br />
      &nbsp;3/x&nbsp;<br />
      &nbsp;4/x&nbsp;<br />
      &nbsp;5/x&nbsp;<br />
      &nbsp;6/x&nbsp;<br />
      &nbsp;7/x&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
To set up the time signature 4/4, you'd take $18 from the right side
and add $02 from the left side, $18 + $02 = $1a.
</p>

<p>
For 6/8 the numbers would be $28 + $03 = $2b.
</p>

<p>
<b><b>Note!</b></b> 1/128 ($07) is known to crash the editor!
</p>
</div>
</li>


<li><a id="org461da26"></a><a id="orgf7310df"></a>$82 DYNLV<br />
<div class="outline-text-5" id="text-4-2-2-3">
<p>
This sets the channel volume ("dynamic level").  The operand is
specified between $00 and $7f.  The replay routine will divide this by
two (with logical bitwise shift to right) and discard the least
significant bit.
</p>
</div>
</li>


<li><a id="org0a54f80"></a><a id="orgef002cc"></a>$83 INSTR<br />
<div class="outline-text-5" id="text-4-2-2-4">
<p>
Set instrument on current track. This should be rather
self-explanatory.
</p>
</div>
</li>


<li><a id="orgd6b1540"></a><a id="orgdee22c3"></a>$84 UDATA<br />
<div class="outline-text-5" id="text-4-2-2-5">
<p>
Note!  The implementation of UDATA is broken in the standalone Medley
Sound Player (msplay)!  Msplay's UDATA handler performs address
displacement calculation incorrectly and jumps to an arbitrary
location in track data.
</p>

<p>
The name of this SCODE isn't very clear regarding its function.  This
one is used to pick a random track from a specified number of
following TRACK lines.  Use of this SCODE must be carefully considered
because the replay routine doesn't sanity check the following track
data and the editor doesn't prevent entering non-functional data.
</p>

<p>
The operand should be a power of two, ie. $02, $04, $08, $10, $20,
$40, or $80.  Using any other value is not of use due to how the SCODE
handler is written.
</p>

<p>
This is how to use UDATA:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">data</th>
<th scope="col" class="org-left">in track editor</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">8404</td>
<td class="org-left">UDATA  04</td>
<td class="org-left">line count following UDATA</td>
</tr>

<tr>
<td class="org-right">8511</td>
<td class="org-left">TRACK  11</td>
<td class="org-left">first line</td>
</tr>

<tr>
<td class="org-right">8512</td>
<td class="org-left">TRACK  12</td>
<td class="org-left">second line</td>
</tr>

<tr>
<td class="org-right">8513</td>
<td class="org-left">TRACK  13</td>
<td class="org-left">third line</td>
</tr>

<tr>
<td class="org-right">8514</td>
<td class="org-left">TRACK  14</td>
<td class="org-left">fourth line</td>
</tr>
</tbody>
</table>

<p>
UDATA doesn't affect track nesting the way ordinary use of TRACK does.
This is because the actual SCODE of the lines following UDATA is
ignored, only the operand is used, and when valid the player continues
from the selected track without modification to the nesting tables.
</p>

<p>
This also means that any lines beyond will be ignored unless an
undefined track is specified.  In case of an undefined track, UDATA
returns as if the operand was $00 and the player continues processing
the following lines in order.
</p>

<p>
Using UDATA within RPEAT/LOOP can also provide unexpected behaviour as
LOOP will return to playing from the track where the RPEAT originally
was!  However, with careful design this feature can also be used to
create eg. drum tracks with pseudo-randomised fills at the ends.
</p>

<p>
Since Medley Sound no longer has Future Player's dedicated "jump to
track" command, UDATA can also be used to replace it by using UDATA
with operand $01:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">data</th>
<th scope="col" class="org-left">track data in editor</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">8401</td>
<td class="org-left">UDATA  01</td>
<td class="org-left">jump to</td>
</tr>

<tr>
<td class="org-right">8511</td>
<td class="org-left">TRACK  11</td>
<td class="org-left">track 11</td>
</tr>
</tbody>
</table>
</div>
</li>


<li><a id="orgd84905c"></a><a id="orgc0e20e7"></a>$85 TRACK<br />
<div class="outline-text-5" id="text-4-2-2-6">
<p>
Go to track specified by the operand.  This command is used to nest
tracks to make a complex song.  Up to eight nested track calls can be
made per channel.  At full nesting any following TRACK commands will
be ignored.
</p>

<p>
The player routine will simply skip undefined tracks.
</p>

<p>
A "return from track" is automatically performed at the track end
code.
</p>
</div>
</li>


<li><a id="org8d2c2cd"></a><a id="orgbfe50c1"></a>$86 RPEAT and <a id="orgd2440d4"></a>$87 LOOP<br />
<div class="outline-text-5" id="text-4-2-2-7">
<p>
These two are used to create loops within tracks.  Up to eight nested
loops can be used per channel.
</p>

<p>
The loop is initiated by RPEAT command with the loop count as its
operand.  The loop starting point is the next line of the track from
which the player will keep playing until LOOP command is encountered.
LOOP will decrease the loop counter by one and jump back to the loop
starting point until the loop counter reaches zero.  The operand of
LOOP is ignored.
</p>
</div>
</li>


<li><a id="org6835596"></a><a id="orgf469b78"></a>$88 TRNSP<br />
<div class="outline-text-5" id="text-4-2-2-8">
<p>
This is used to set the transposition byte of the channel.  It's a
signed value, so anything from $80 to $ff is considered a two's
complement, ie. $ff = -1, $fe = -2, etc.
</p>

<p>
The transposition is defined in semitones.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org168d2a2" class="outline-3">
<h3 id="org168d2a2"><span class="section-number-3">4.3.</span> Important DO NOTs:</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Do not set the time signature to 1/128 ($07).  The editor will
freeze if you do so and there are any notes on the following lines.</li>

<li>Do no use the "halftone up" command ('=') to set notes beyond B-9.
You'll eventually reach the end code after 'F-;' and the editor will
freeze if the track is playing while editing.</li>
</ul>
</div>
</div>
</div>
