msed-manual.org
* Instrument Editor

|------------+--------------------------------------------------------------|
| ~1~ .. ~4~ | Edit [[ie_mg][MG parameters]]                                           |
| ~e~        | Edit volume [[ie_env][envelope parameters]]                              |
| ~f~        | Test note selection                                          |
| ~o~        | Octave bank                                                  |
| ~p~        | Play test note                                               |
| ~s~        | Edit [[ie_snd][sound parameters]]                                        |
| ~v~        | View output wave (useful to check BShift/DShift modulation)  |
| ~w~        | Go to wave editor                                            |
| ~<~        | Replace current instrument with data from another instrument |
|------------+--------------------------------------------------------------|


** <<ie_snd>>SND

This section specifies the following parameters:


*** a:Mo - sound mode

The sound mode can be one of the following:

|-----+-------+-------------------------------------------------------|
| $00 | <std> | standard (a.k.a. normal or plain sample) mode, looped |
| $01 | <bsm> | base shift mode                                       |
| $02 | <dyn> | dynamic mode                                          |
| $03 | <???> | single-shot std mode                                  |
|-----+-------+-------------------------------------------------------|

Any other value for this parameter defaults to single-shot std mode.

Caveat: In single-shot mode the previous sample must end before
another one will play on the same channel!  This is something to keep
in mind when making drum tracks, ie. keep your drum samples short or
end longer ones with a rest and fast volume envelope release.


**** <std> and <???>

This is the simplest sample player mode and will play samples as is.
The <???> is the single-shot variant of standard mode and is suitable
for drum and effect samples.


**** <bsm>

This is the "base shift mode".  The base shift mode uses an offsetting
method to select a "window" of a wave to be played.  This window can
be shifted on the fly with a [[ie_mg][MG]] to make a pulse-width modulation style
effect with an appropriately crafted wave.

Parameters specific to this mode are tagged with ~<bsm>~.


**** <dyn>

This is the "dynamic mode". The dynamic mode creates the final
waveform on the fly by mixing together two copies of the selected
wave.  These copies can be shifted in relation to each other and their
frequencies can be altered to create complex sounds.  The dynamic
nature of this mode allows seamless on-the-fly generation of higher
frequency waveforms for higher octaves without creating separate
waves.

Shifting and frequencies can be modulated with [[ie_mg][MG]]s.  Parameters
specific to this mode are tagged with ~<dyn>~.


*** b:Wa - wave

This sets the wave used by this instrument.  For standard and base
shifted modes a wave table of eight can be set up for higher octaves.


*** c:Bs - Base shift ~<bsm>~

This value offsets the waveform from its starting point.  For this to
create audible sound difference, an appropriately crafted wave is
required.


*** d:Ds - Dynamic shift ~<dyn>~

This value offsets the first copy of the waveform that the other copy
is mixed on top of.


*** e:Tr - transpose

The transpose parameter is entered as an unsigned byte and evaluated
as a signed byte, ie. $ff = -1, $fe = -2, etc.


*** f:Fq - Dynamic frequency ~<dyn>~

This parameter is only functional in sound mode 02.  Each of the
nybbles (individual hexadeciaml digits) represent a frequency
multiplier from ~$1~ to ~$10~ for the two waves to be mixed.  A ~$0~
is interpreted as ~$10~.

The base value to start with is ~$11~ instead of ~$00~.

The left number is for the "DShifted" first copy and the right value
is for the non-DShifted second copy mixed on top the first copy.

Tip: Editing this parameter is easiest to do with the numpad, 7 and 9
to edit the left nybble, and 1 and 3 to edit the right nybble.


** <<ie_env>>ENV - Envelope Generator

This section specifies the envelope generator parameters.

When editing these parameters, the generated "slopes" are shown in the
parameter window next to the waveform.  The slope values represent the
amount of change made at each player tick.

Internally the envelope generator is 16-bit. The most significant six
bits of the final calculated value after ADSR and MG calculations is
used to address a volume value from the volume table.


*** a:Tr - (unused?)

This parameter appears not to be used.


*** b:At - Attack time

This parameter specifies the attack time from start of note to Peak
level.  This value together with Peak level is used to calculate
ASlope (Attack Slope), which is the value used by the player
internally.

Attack time of $ff represents infinity and will make the instrument
silent.


*** c:Tl - Peak level (Top level)

This parameter specifies the Peak level between attack and decay.
Once this level is reached, the EG switches from attack to decay.


*** d:Dt - Decay time

This parameter specifies the decay time from Peak level to Sustain
level.  This value together with Peak and Sustain levels is used to
calculate DSlope (Decay Slope), which is the value used by the player
internally.

Decay time of $ff represents infinity, which means that the peak level
will also be the sustain level.


*** e:Sl - Sustain level

This parameter specifies the Sustain level.  The note volume will
decay to and stay at this level until note-off (rest, ~----~).


