msed-manual.html


<div id="outline-container-org576724c" class="outline-2">
<h2 id="org576724c"><span class="section-number-2">5.</span> Instrument Editor</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>1</code> .. <code>4</code></td>
<td class="org-left">Edit <a href="#orgcd239eb">MG parameters</a></td>
</tr>

<tr>
<td class="org-left"><code>e</code></td>
<td class="org-left">Edit volume <a href="#org01c35eb">envelope parameters</a></td>
</tr>

<tr>
<td class="org-left"><code>f</code></td>
<td class="org-left">Test note selection</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">Octave bank</td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left">Play test note</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left">Edit <a href="#org24fd1c9">sound parameters</a></td>
</tr>

<tr>
<td class="org-left"><code>v</code></td>
<td class="org-left">View output wave (useful to check BShift/DShift modulation)</td>
</tr>

<tr>
<td class="org-left"><code>w</code></td>
<td class="org-left">Go to wave editor</td>
</tr>

<tr>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">Replace current instrument with data from another instrument</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org6397e66" class="outline-3">
<h3 id="org6397e66"><span class="section-number-3">5.1.</span> <a id="org24fd1c9"></a>SND</h3>
<div class="outline-text-3" id="text-5-1">
<p>
This section specifies the following parameters:
</p>
</div>


<div id="outline-container-orgf9ff0bd" class="outline-4">
<h4 id="orgf9ff0bd"><span class="section-number-4">5.1.1.</span> a:Mo - sound mode</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
The sound mode can be one of the following:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">$00</td>
<td class="org-left">&lt;std&gt;</td>
<td class="org-left">standard (a.k.a. normal or plain sample) mode, looped</td>
</tr>

<tr>
<td class="org-left">$01</td>
<td class="org-left">&lt;bsm&gt;</td>
<td class="org-left">base shift mode</td>
</tr>

<tr>
<td class="org-left">$02</td>
<td class="org-left">&lt;dyn&gt;</td>
<td class="org-left">dynamic mode</td>
</tr>

<tr>
<td class="org-left">$03</td>
<td class="org-left">&lt;???&gt;</td>
<td class="org-left">single-shot std mode</td>
</tr>
</tbody>
</table>

<p>
Any other value for this parameter defaults to single-shot std mode.
</p>

<p>
Caveat: In single-shot mode the previous sample must end before
another one will play on the same channel!  This is something to keep
in mind when making drum tracks, ie. keep your drum samples short or
end longer ones with a rest and fast volume envelope release.
</p>
</div>


<ol class="org-ol">
<li><a id="org1bacb7d"></a>&lt;std&gt; and &lt;???&gt;<br />
<div class="outline-text-5" id="text-5-1-1-1">
<p>
This is the simplest sample player mode and will play samples as is.
The &lt;???&gt; is the single-shot variant of standard mode and is suitable
for drum and effect samples.
</p>
</div>
</li>


<li><a id="orgb140f10"></a>&lt;bsm&gt;<br />
<div class="outline-text-5" id="text-5-1-1-2">
<p>
This is the "base shift mode".  The base shift mode uses an offsetting
method to select a "window" of a wave to be played.  This window can
be shifted on the fly with a <a href="#orgcd239eb">MG</a> to make a pulse-width modulation style
effect with an appropriately crafted wave.
</p>

<p>
Parameters specific to this mode are tagged with <code>&lt;bsm&gt;</code>.
</p>
</div>
</li>


<li><a id="org067ad02"></a>&lt;dyn&gt;<br />
<div class="outline-text-5" id="text-5-1-1-3">
<p>
This is the "dynamic mode". The dynamic mode creates the final
waveform on the fly by mixing together two copies of the selected
wave.  These copies can be shifted in relation to each other and their
frequencies can be altered to create complex sounds.  The dynamic
nature of this mode allows seamless on-the-fly generation of higher
frequency waveforms for higher octaves without creating separate
waves.
</p>

<p>
Shifting and frequencies can be modulated with <a href="#orgcd239eb">MG</a>s.  Parameters
specific to this mode are tagged with <code>&lt;dyn&gt;</code>.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-org951ede0" class="outline-4">
<h4 id="org951ede0"><span class="section-number-4">5.1.2.</span> b:Wa - wave</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
This sets the wave used by this instrument.  For standard and base
shifted modes a wave table of eight can be set up for higher octaves.
</p>
</div>
</div>


<div id="outline-container-orgafd52c0" class="outline-4">
<h4 id="orgafd52c0"><span class="section-number-4">5.1.3.</span> c:Bs - Base shift <code>&lt;bsm&gt;</code></h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
This value offsets the waveform from its starting point.  For this to
create audible sound difference, an appropriately crafted wave is
required.
</p>
</div>
</div>


<div id="outline-container-org86b9b68" class="outline-4">
<h4 id="org86b9b68"><span class="section-number-4">5.1.4.</span> d:Ds - Dynamic shift <code>&lt;dyn&gt;</code></h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
This value offsets the first copy of the waveform that the other copy
is mixed on top of.
</p>
</div>
</div>


<div id="outline-container-org5ad3580" class="outline-4">
<h4 id="org5ad3580"><span class="section-number-4">5.1.5.</span> e:Tr - transpose</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
The transpose parameter is entered as an unsigned byte and evaluated
as a signed byte, ie. $ff = -1, $fe = -2, etc.
</p>
</div>
</div>


<div id="outline-container-org10b1c82" class="outline-4">
<h4 id="org10b1c82"><span class="section-number-4">5.1.6.</span> f:Fq - Dynamic frequency <code>&lt;dyn&gt;</code></h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
This parameter is only functional in sound mode 02.  Each of the
nybbles (individual hexadeciaml digits) represent a frequency
multiplier from <code>$1</code> to <code>$10</code> for the two waves to be mixed.  A <code>$0</code>
is interpreted as <code>$10</code>.
</p>

<p>
The base value to start with is <code>$11</code> instead of <code>$00</code>.
</p>

<p>
The left number is for the "DShifted" first copy and the right value
is for the non-DShifted second copy mixed on top the first copy.
</p>

<p>
Tip: Editing this parameter is easiest to do with the numpad, 7 and 9
to edit the left nybble, and 1 and 3 to edit the right nybble.
</p>
</div>
</div>
</div>


<div id="outline-container-org8022007" class="outline-3">
<h3 id="org8022007"><span class="section-number-3">5.2.</span> <a id="org01c35eb"></a>ENV - Envelope Generator</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This section specifies the envelope generator parameters.
</p>

<p>
When editing these parameters, the generated "slopes" are shown in the
parameter window next to the waveform.  The slope values represent the
amount of change made at each player tick.
</p>

<p>
Internally the envelope generator is 16-bit. The most significant six
bits of the final calculated value after ADSR and MG calculations is
used to address a volume value from the volume table.
</p>
</div>


<div id="outline-container-org1710caa" class="outline-4">
<h4 id="org1710caa"><span class="section-number-4">5.2.1.</span> a:Tr - (unused?)</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
This parameter appears not to be used.
</p>
</div>
</div>


<div id="outline-container-orge52e18f" class="outline-4">
<h4 id="orge52e18f"><span class="section-number-4">5.2.2.</span> b:At - Attack time</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
This parameter specifies the attack time from start of note to Peak
level.  This value together with Peak level is used to calculate
ASlope (Attack Slope), which is the value used by the player
internally.
</p>

<p>
Attack time of $ff represents infinity and will make the instrument
silent.
</p>
</div>
</div>


<div id="outline-container-org3cfa5d9" class="outline-4">
<h4 id="org3cfa5d9"><span class="section-number-4">5.2.3.</span> c:Tl - Peak level (Top level)</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
This parameter specifies the Peak level between attack and decay.
Once this level is reached, the EG switches from attack to decay.
</p>
</div>
</div>


<div id="outline-container-org20c3cfb" class="outline-4">
<h4 id="org20c3cfb"><span class="section-number-4">5.2.4.</span> d:Dt - Decay time</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
This parameter specifies the decay time from Peak level to Sustain
level.  This value together with Peak and Sustain levels is used to
calculate DSlope (Decay Slope), which is the value used by the player
internally.
</p>

<p>
Decay time of $ff represents infinity, which means that the peak level
will also be the sustain level.
</p>
</div>
</div>


<div id="outline-container-org215f18e" class="outline-4">
<h4 id="org215f18e"><span class="section-number-4">5.2.5.</span> e:Sl - Sustain level</h4>
<div class="outline-text-4" id="text-5-2-5">
<p>
This parameter specifies the Sustain level.  The note volume will
decay to and stay at this level until note-off (rest, "-&#x2014;").
</p>
</div>
</div>
