msed-manual.org
*** f:Rt - Release Time

This parameter specifies the time it takes from note-off to silence.
This value together with Sustain Level is used to calculate RSlope
(Release Slope), which is the value used by the player internally.

Release time of $ff represents infinity, ie. the sound will never
stop, even after a note-off, until a new note is played or the player
routine is stopped.


** <<ie_mg>>MG - Modulation Generator

Each instrument features four identical modulation generators.
Depending on the [[ie_mgBl][Block wave]] flag the oscillator generates a
triangle/saw or a square wave with time constants S1 and S2.

Similarly to the volume Envelope Generator, modulation speed is
relative to song speed (ie. score tempo).


*** a:De - Destination

The modulation destination is a hexadecimal number between $00 and
$07.  Any numbers past $07 are interpreted as $07.


**** $00 : off

The replayer will bypass any MG that is set off.  The other parameters
will not be processed at all.


**** $01 : FM - Frequency Modulation

Frequency modulation modulates the playback frequency of the sound,
just like it says on the tin.  This produces a vibrato effect.

This modulation results in a signed 8-bit value and affects the
playback period directly.


**** $02 : AM - Amplitude Modulation

This is the same for the amplitude, or volume of the sound, ie. a
tremolo effect.

Amplitude modulation is applied to the 16-bit internal amplitude value
after ADSR.


**** $03 : BShift - Base shift modulation ~<bsm>~

This modulates the base shift of the instrument.  With a specially
crafted waveform this can be used to create eg. a pulse-width
modulated square wave sound.

This modulation is internally 8-bit.


**** $04 : DShift - Dynamic shift modulation ~<dyn>~

This modulates the dynamic shift of the instrument.

This modulation is internally 8-bit.


**** $05 / $06 : FM+ / FM- - Frequency Modulation (period up = frequency down) / (period down = frequency up)

Unlike the ordinary FM mode ($01), these frequency modulation modes
modulate the frequency either up or down from the note frequency.

These modulations are internally 11-bit and affect the playback period
directly.


**** $07 : DynFreq - Dynamic frequency modulation ~<dyn>~

This modulates the waveform frequencies of a dynamic instrument.  Do
keep in mind that the modulation affects the whole byte, not just for
one or the other nybble.  However, with careful crafting of slope
values it may be possible to make fine changes to both nybbles in a
predictable manner.

This modulation is internally 8-bit.


*** <<ie_mgBl>>b:Bl - Block wave (boolean, $00 = off)

Setting this non-zero will cause the replayer to use the S1 and S2
parameters as time constants to make a square wave modulation instead
of the default triangle/saw wave.


*** c:Tr - Trigger mode (boolean, $00 = trigger at every note-on)

When trigger mode is set non-zero, the MG is not retriggered as long
as a note is being played.  This is useful to create a slowly changing
modulation over several notes.


*** d:Ss - Single-shot (boolean, $00 = off)

When single-shot mode is enabled, the MG will run only once and stop.


*** e:Sg - (unused)

This parameter appears not to be used.


*** f:Rv - Reverse (boolean, $00 = off)

Reverses the modulation operation, ie. modulating up becomes
modulating down and vice versa.


*** g:Dt - Delay time

This parameter specifies the time from trigger to start of modulation.
Time is specified in player ticks.


*** h:Lv - Level

This parameter specifies the amplitude, or level of modulation.
Internally the modulation level is a 16-bit value, of which the user
input is the most significant byte.


*** i:S1 / j:S2 - Slope 1 / Slope 2

These two slope time parameters are used to shape the modulation
waveform.


*** k:Hs / l:Qs - Half-shift / Quarter-shift

These values are used to shift the starting point of modulation
waveform depending on the channel the instrument plays on.  They're
mostly useful to desync modulators of an instrument playing on two
channels at the same time.

The Half-shift sets the initial modulation value to the Modulation
level.  The Quarter-shift sets the initial modulation value to half
the Modulation level.

|-------+-----------------------------------------------------------------|
| value | description                                                     |
|-------+-----------------------------------------------------------------|
| $00   | off                                                             |
|-------+-----------------------------------------------------------------|
| $01   | ~sch_FlagLR~ - shift is applied if the instrument plays on the  |
|       | right channel, ie. on channel 2 or 3.                           |
|-------+-----------------------------------------------------------------|
| $02   | ~sch_FlagLH~ - shift is applied if the instrument plays on the  |
|       | "higher" channel, ie. on channel 2 or 4.                        |
|-------+-----------------------------------------------------------------|
| > $02 | Undefined behaviour.  Non-zero values are used to address Sound |
|       | Channel structure directly.                                     |
|-------+-----------------------------------------------------------------|

Quarter-shift takes the higher priority if both are set.
      
Quarter-shift is always enabled for frequency modulation (destination
$01) when a delay time is set.


