msed-manual.html


<div id="outline-container-orgd531fe5" class="outline-4">
<h4 id="orgd531fe5"><span class="section-number-4">5.2.6.</span> f:Rt - Release Time</h4>
<div class="outline-text-4" id="text-5-2-6">
<p>
This parameter specifies the time it takes from note-off to silence.
This value together with Sustain Level is used to calculate RSlope
(Release Slope), which is the value used by the player internally.
</p>

<p>
Release time of $ff represents infinity, ie. the sound will never
stop after a note-off.
</p>
</div>
</div>
</div>


<div id="outline-container-org31b27b7" class="outline-3">
<h3 id="org31b27b7"><span class="section-number-3">5.3.</span> <a id="orgcd239eb"></a>MG - Modulation Generator</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Each instrument features four identical modulation generators.
Depending on the <a href="#orge2ac16b">Block wave</a> flag the oscillator generates a
triangle/saw or a square wave with time constants S1 and S2.
</p>

<p>
Similarly to the volume Envelope Generator, modulation speed is
relative to song speed (ie. score tempo).
</p>
</div>


<div id="outline-container-orge92f4cf" class="outline-4">
<h4 id="orge92f4cf"><span class="section-number-4">5.3.1.</span> a:De - Destination</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
The modulation destination is a hexadecimal number between $00 and
$07.  Any numbers past $07 are interpreted as $07.
</p>
</div>


<ol class="org-ol">
<li><a id="org9ecdb18"></a>$00 : off<br />
<div class="outline-text-5" id="text-5-3-1-1">
<p>
The replayer will bypass any MG that is set off.  The other parameters
will not be processed at all.
</p>
</div>
</li>


<li><a id="org82e438b"></a>$01 : FM - Frequency Modulation<br />
<div class="outline-text-5" id="text-5-3-1-2">
<p>
Frequency modulation modulates the playback frequency of the sound,
just like it says on the tin.  This produces a vibrato effect.
</p>

<p>
This modulation results in a signed 8-bit value and affects the
playback period directly.
</p>
</div>
</li>


<li><a id="orga07f2b0"></a>$02 : AM - Amplitude Modulation<br />
<div class="outline-text-5" id="text-5-3-1-3">
<p>
This is the same for the amplitude, or volume of the sound, ie. a
tremolo effect.
</p>

<p>
Amplitude modulation is applied to the 16-bit internal amplitude value
after ADSR.
</p>
</div>
</li>


<li><a id="orgad5f0ad"></a>$03 : BShift - Base shift modulation <code>&lt;bsm&gt;</code><br />
<div class="outline-text-5" id="text-5-3-1-4">
<p>
This modulates the base shift of the instrument.  With a specially
crafted waveform this can be used to create eg. a pulse-width
modulated square wave sound.
</p>

<p>
This modulation is internally 8-bit.
</p>
</div>
</li>


<li><a id="orgcc9234f"></a>$04 : DShift - Dynamic shift modulation <code>&lt;dyn&gt;</code><br />
<div class="outline-text-5" id="text-5-3-1-5">
<p>
This modulates the dynamic shift of the instrument.
</p>

<p>
This modulation is internally 8-bit.
</p>
</div>
</li>


<li><a id="org5f0701a"></a>$05 / $06 : FM+ / FM- - Frequency Modulation (period up = frequency down) / (period down = frequency up)<br />
<div class="outline-text-5" id="text-5-3-1-6">
<p>
Unlike the ordinary FM mode ($01), these frequency modulation modes
modulate the frequency either up or down from the note frequency.
</p>

<p>
These modulations are internally 11-bit and affect the playback period
directly.
</p>
</div>
</li>


<li><a id="orgdf074aa"></a>$07 : DynFreq - Dynamic frequency modulation <code>&lt;dyn&gt;</code><br />
<div class="outline-text-5" id="text-5-3-1-7">
<p>
This modulates the waveform frequencies of a dynamic instrument.  Do
keep in mind that the modulation affects the whole byte, not just for
one or the other nybble.  However, with careful crafting of slope
values it may be possible to make fine changes to both nybbles in a
predictable manner.
</p>

<p>
This modulation is internally 8-bit.
</p>
</div>
</li>
</ol>
</div>


<div id="outline-container-org8096a45" class="outline-4">
<h4 id="org8096a45"><span class="section-number-4">5.3.2.</span> <a id="orge2ac16b"></a>b:Bl - Block wave (boolean, $00 = off)</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Setting this non-zero will cause the replayer to use the S1 and S2
parameters as time constants to make a square wave modulation instead
of the default triangle/saw wave.
</p>
</div>
</div>


<div id="outline-container-org86221f1" class="outline-4">
<h4 id="org86221f1"><span class="section-number-4">5.3.3.</span> c:Tr - Trigger mode (boolean, $00 = trigger at every note-on)</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
When trigger mode is set non-zero, the MG is not retriggered as long
as a note is being played.  This is useful to create a slowly changing
modulation over several notes.
</p>
</div>
</div>


<div id="outline-container-orgf2a2462" class="outline-4">
<h4 id="orgf2a2462"><span class="section-number-4">5.3.4.</span> d:Ss - Single-shot (boolean, $00 = off)</h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
When single-shot mode is enabled, the MG will run only once and stop.
</p>
</div>
</div>


<div id="outline-container-orga8e43b4" class="outline-4">
<h4 id="orga8e43b4"><span class="section-number-4">5.3.5.</span> e:Sg - (unused)</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
This parameter appears not to be used.
</p>
</div>
</div>


<div id="outline-container-org9acba2f" class="outline-4">
<h4 id="org9acba2f"><span class="section-number-4">5.3.6.</span> f:Rv - Reverse (boolean, $00 = off)</h4>
<div class="outline-text-4" id="text-5-3-6">
<p>
Reverses the modulation operation, ie. modulating up becomes
modulating down and vice versa.
</p>
</div>
</div>


<div id="outline-container-org1b6ba3f" class="outline-4">
<h4 id="org1b6ba3f"><span class="section-number-4">5.3.7.</span> g:Dt - Delay time</h4>
<div class="outline-text-4" id="text-5-3-7">
<p>
This parameter specifies the time from trigger to start of modulation.
Time is specified in player ticks.
</p>
</div>
</div>


<div id="outline-container-org6706266" class="outline-4">
<h4 id="org6706266"><span class="section-number-4">5.3.8.</span> h:Lv - Level</h4>
<div class="outline-text-4" id="text-5-3-8">
<p>
This parameter specifies the amplitude, or level of modulation.
Internally the modulation level is a 16-bit value, of which the user
input is the most significant byte.
</p>
</div>
</div>


<div id="outline-container-orgf9e0372" class="outline-4">
<h4 id="orgf9e0372"><span class="section-number-4">5.3.9.</span> i:S1 / j:S2 - Slope 1 / Slope 2</h4>
<div class="outline-text-4" id="text-5-3-9">
<p>
These two slope time parameters are used to shape the modulation
waveform.
</p>
</div>
</div>


<div id="outline-container-org1109850" class="outline-4">
<h4 id="org1109850"><span class="section-number-4">5.3.10.</span> k:Hs / l:Qs - Half-shift / Quarter-shift</h4>
<div class="outline-text-4" id="text-5-3-10">
<p>
These values are used to shift the starting point of modulation
waveform depending on the channel the instrument plays on.  They're
mostly useful to desync modulators of an instrument playing on two
channels at the same time.
</p>

<p>
The Half-shift sets the initial modulation value to the Modulation
level.  The Quarter-shift sets the initial modulation value to half
the Modulation level.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">value</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">$00</td>
<td class="org-left">off</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">$01</td>
<td class="org-left"><code>sch_FlagLR</code> - shift is applied if the instrument plays on the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">right channel, ie. on channel 2 or 3.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">$02</td>
<td class="org-left"><code>sch_FlagLH</code> - shift is applied if the instrument plays on the</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">"higher" channel, ie. on channel 2 or 4.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&gt; $02</td>
<td class="org-left">Undefined behaviour.  Non-zero values are used to address Sound</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Channel structure directly.</td>
</tr>
</tbody>
</table>

<p>
Quarter-shift takes the higher priority if both are set.
</p>

<p>
Quarter-shift is always enabled for frequency modulation (destination
$01) when a delay time is set.
</p>
</div>
</div>
</div>
</div>
