msed-manual.org
* Wave Editor

The Medley Sound Wave Editor is a simple yet powerful tool to make
short waveforms for use with Base Shift and Dynamic modes.  There are
four waveform displays on top: current sample buffer (Source A),
Source B, Result, and Undo Buffer.  Source B can be used to copy
sample data to other waves/samples.

Below each waveform is a parameter display, for example for a freshly
loaded preset sine wave it is ~80, 80 s1 x1~ while a sample merged
from an external source might have something like ~23f0, 0 s0 x0~.

1. The first hexadecimal number is the data buffer length.

2. The second value is currently known as "dummy".  A known use for it
   hasn't been discovered, yet.

3. The letter after the two described above shows if the sample is
   single- (s) or double-buffered (d).

4. The number after the buffer mode flag is the octave.  This value
   should be between 0 and 7.  Any other values for octaves will
   provide unpredictable results as the player routine will address
   memory outside the actual octave multiplier table.

5. The last one is the "FragFactor" which is not used.

|--------------+-------------------------------------------|
| ~/~          | Swap sources A and B                      |
| ~,~ (comma)  | Copy Result to Source A                   |
| ~.~ (period) | Copy Source A to Source B                 |
| ~u~          | Copy Undo buffer to Source A, "undo"      |
| ~k~          | Copy Source A to Undo Buffer, "kill"      |
| ~r~          | Rename wave                               |
| ~c~          | Change wave ie. choose another wave       |
| ~N~          | Allocate a new wave (into an unused slot) |
| ~S~          | Set wave buffer "single"                  |
| ~D~          | Set wave buffer "double"                  |
| ~o~          | Perform [[we_ops][operations]]                        |
| ~p~          | Generate a [[we_preset][preset]] waveform                |
|--------------+-------------------------------------------|


** Frags

These operations are not implemented.


** <<we_ops>>Operations

These mathematical operations allow editing and mixing of sample data
to create complex waveforms from simple waveforms generated with the
[[we_preset][Preset]] function.

*** a:SX – shift source A left in samples

This operation offsets the Source A waveform in a way that makes it
appear to move left in the visual preview.


*** b:SY – shift source A down (add a fixed value to each sample)

This operation adds a signed byte value to each sample of Source A,
which makes the waveform move down in the visual preview.


*** c:AM – amplitude (10 = no change)

This operation adjusts the amplitude of the Result waveform after
mixing.  The default is $10 and doesn't affect the aplitude, $08 is
half the amplitude and $20 is twice the amplitude.


*** d:FQ – frequency of source A (10 = no change)

This operation shrinks or expands the wave data of Source A to alter
its playback frequency.  It will not affect the mixed in Source B.


*** e:MX – mix sources (00 = A; ff = B; 80 will mix 50/50)

This operation mixes sources A and B.  Value of $00 will bypass the
mixing and use only Source A.  Value of $ff will use only Source B and
$80 will mix both evenly together.

The thing to keep in mind is that the Source B will not be looped if
it is shorter than the Result buffer!


*** f:RE - Adjust Result buffer length

This operation adjusts the Result buffer length.  This value defaults
to $10 which matches the length of Source A.  $08 will mean half the
length of Source A and $20 is double the length.

Do keep in mind that the octave number is calculated from the length
of the waveform data.  If you lengthen the waveform beyond 0x17e, or
382 bytes to make the octave go negative, it will no longer play back
right outside the wave editor.  This will also affect modifying longer
samples imported from external sources!


*** g:UF

This operation is not implemented.


*** h:PE – playback period (higher value = lower frequency)

This affects only the playback period of the previewed Result buffer,
not the buffer itself.


** <<we_preset>>Preset - generate waveforms

This operation is used to generate waveforms.  The operation will
replace any waveform data in Source A.


*** a:RA - generate a saw/triangle wave

The operand is used to adjust the duty cycle of the triangle wave.
$80 is pure triangle.


*** b:PU - generate a pulse/square wave

The operand is used to adjust the duty cycle of the square wave.  $80
equals 50%.


*** s - precalculated sine wave

Press ~s~ to copy the precalculated sine wave to Source A.


* File Menu

** (l)oad, (m)erge, and (i)mport

Medley Sound editor is able to load its own project format PVMS as
well as SMUS/IFF song data. The third supported format is raw sample
data encapsulated in a =HUNK_UNIT= file.

*Warning!* Loading will destroy your current project, even if you're
loading just a sample!  Use Merge or Import to load a sample into your
existing project!

The difference between Merge and Import is that Merge will silently
merge a complete PVMS project into the current one.  Import will query
what content is to be imported.


** (s)ave

This function saves the current project into a PVMS file.  The editor
is not directly able to save to Medley Sound Object (MSOB) format.


