msed-manual.html


<div id="outline-container-org07144d9" class="outline-2">
<h2 id="org07144d9"><span class="section-number-2">6.</span> Wave Editor</h2>
<div class="outline-text-2" id="text-6">
<p>
The Medley Sound Wave Editor is a simple yet powerful tool to make
short waveforms for use with Base Shift and Dynamic modes.  There are
four waveform displays on top: current sample buffer (Source A),
Source B, Result, and Undo Buffer.  Source B can be used to copy
sample data to other waves/samples.
</p>

<p>
Below each waveform is a parameter display, for example for a freshly
loaded preset sine wave it is <code>80, 80 s1 x1</code> while a sample merged
from an external source might have something like <code>23f0, 0 s0 x0</code>.
</p>

<ol class="org-ol">
<li>The first hexadecimal number is the data buffer length.</li>

<li>The second value is currently known as "dummy".  A known use for it
hasn't been discovered, yet.</li>

<li>The letter after the two described above shows if the sample is
single- (s) or double-buffered (d).</li>

<li>The number after the buffer mode flag is the octave.  This value
should be between 0 and 7.  Any other values for octaves will
provide unpredictable results as the player routine will address
memory outside the actual octave multiplier table.</li>

<li>The last one is the "FragFactor" which is not used.</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">Swap sources A and B</td>
</tr>

<tr>
<td class="org-left"><code>,</code> (comma)</td>
<td class="org-left">Copy Result to Source A</td>
</tr>

<tr>
<td class="org-left"><code>.</code> (period)</td>
<td class="org-left">Copy Source A to Source B</td>
</tr>

<tr>
<td class="org-left"><code>u</code></td>
<td class="org-left">Copy Undo buffer to Source A, "undo"</td>
</tr>

<tr>
<td class="org-left"><code>k</code></td>
<td class="org-left">Copy Source A to Undo Buffer, "kill"</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left">Rename wave</td>
</tr>

<tr>
<td class="org-left"><code>c</code></td>
<td class="org-left">Change wave ie. choose another wave</td>
</tr>

<tr>
<td class="org-left"><code>N</code></td>
<td class="org-left">Allocate a new wave (into an unused slot)</td>
</tr>

<tr>
<td class="org-left"><code>S</code></td>
<td class="org-left">Set wave buffer "single"</td>
</tr>

<tr>
<td class="org-left"><code>D</code></td>
<td class="org-left">Set wave buffer "double"</td>
</tr>

<tr>
<td class="org-left"><code>o</code></td>
<td class="org-left">Perform <a href="#orgdad5128">operations</a></td>
</tr>

<tr>
<td class="org-left"><code>p</code></td>
<td class="org-left">Generate a <a href="#orgcdb5f7f">preset</a> waveform</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-orgdd896cf" class="outline-3">
<h3 id="orgdd896cf"><span class="section-number-3">6.1.</span> Frags</h3>
<div class="outline-text-3" id="text-6-1">
<p>
These operations are not implemented.
</p>
</div>
</div>


<div id="outline-container-orge51f9e9" class="outline-3">
<h3 id="orge51f9e9"><span class="section-number-3">6.2.</span> <a id="orgdad5128"></a>Operations</h3>
<div class="outline-text-3" id="text-6-2">
<p>
These mathematical operations allow editing and mixing of sample data
to create complex waveforms from simple waveforms generated with the
<a href="#orgcdb5f7f">Preset</a> function.
</p>
</div>

<div id="outline-container-orgc64451a" class="outline-4">
<h4 id="orgc64451a"><span class="section-number-4">6.2.1.</span> a:SX – shift source A left in samples</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
This operation offsets the Source A waveform in a way that makes it
appear to move left in the visual preview.
</p>
</div>
</div>


<div id="outline-container-org3467bd5" class="outline-4">
<h4 id="org3467bd5"><span class="section-number-4">6.2.2.</span> b:SY – shift source A down (add a fixed value to each sample)</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
This operation adds a signed byte value to each sample of Source A,
which makes the waveform move down in the visual preview.
</p>
</div>
</div>


<div id="outline-container-orgf7ddede" class="outline-4">
<h4 id="orgf7ddede"><span class="section-number-4">6.2.3.</span> c:AM – amplitude (10 = no change)</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
This operation adjusts the amplitude of the Result waveform after
mixing.  The default is $10 and doesn't affect the aplitude, $08 is
half the amplitude and $20 is twice the amplitude.
</p>
</div>
</div>


<div id="outline-container-org712d3ce" class="outline-4">
<h4 id="org712d3ce"><span class="section-number-4">6.2.4.</span> d:FQ – frequency of source A (10 = no change)</h4>
<div class="outline-text-4" id="text-6-2-4">
<p>
This operation shrinks or expands the wave data of Source A to alter
its playback frequency.  It will not affect the mixed in Source B.
</p>
</div>
</div>


<div id="outline-container-org01e84d9" class="outline-4">
<h4 id="org01e84d9"><span class="section-number-4">6.2.5.</span> e:MX – mix sources (00 = A; ff = B; 80 will mix 50/50)</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
This operation mixes sources A and B.  Value of $00 will bypass the
mixing and use only Source A.  Value of $ff will use only Source B and
$80 will mix both evenly together.
</p>

<p>
The thing to keep in mind is that the Source B will not be looped if
it is shorter than the Result buffer!
</p>
</div>
</div>


<div id="outline-container-orgd3b5d2a" class="outline-4">
<h4 id="orgd3b5d2a"><span class="section-number-4">6.2.6.</span> f:RE - Adjust Result buffer length</h4>
<div class="outline-text-4" id="text-6-2-6">
<p>
This operation adjusts the Result buffer length.  This value defaults
to $10 which matches the length of Source A.  $08 will mean half the
length of Source A and $20 is double the length.
</p>

<p>
Do keep in mind that the octave number is calculated from the length
of the waveform data.  If you lengthen the waveform beyond 0x17e, or
382 bytes to make the octave go negative, it will no longer play back
right outside the wave editor.  This will also affect modifying longer
samples imported from external sources!
</p>
</div>
</div>


<div id="outline-container-org5602251" class="outline-4">
<h4 id="org5602251"><span class="section-number-4">6.2.7.</span> g:UF</h4>
<div class="outline-text-4" id="text-6-2-7">
<p>
This operation is not implemented.
</p>
</div>
</div>


<div id="outline-container-orgdf2c837" class="outline-4">
<h4 id="orgdf2c837"><span class="section-number-4">6.2.8.</span> h:PE – playback period (higher value = lower frequency)</h4>
<div class="outline-text-4" id="text-6-2-8">
<p>
This affects only the playback period of the previewed Result buffer,
not the buffer itself.
</p>
</div>
</div>
</div>


<div id="outline-container-org0e2faa9" class="outline-3">
<h3 id="org0e2faa9"><span class="section-number-3">6.3.</span> <a id="orgcdb5f7f"></a>Preset - generate waveforms</h3>
<div class="outline-text-3" id="text-6-3">
<p>
This operation is used to generate waveforms.  The operation will
replace any waveform data in Source A.
</p>
</div>


<div id="outline-container-org05b796c" class="outline-4">
<h4 id="org05b796c"><span class="section-number-4">6.3.1.</span> a:RA - generate a saw/triangle wave</h4>
<div class="outline-text-4" id="text-6-3-1">
<p>
The operand is used to adjust the duty cycle of the triangle wave.
$80 is pure triangle.
</p>
</div>
</div>


<div id="outline-container-org64f3a8c" class="outline-4">
<h4 id="org64f3a8c"><span class="section-number-4">6.3.2.</span> b:PU - generate a pulse/square wave</h4>
<div class="outline-text-4" id="text-6-3-2">
<p>
The operand is used to adjust the duty cycle of the square wave.  $80
equals 50%.
</p>
</div>
</div>


<div id="outline-container-org6102bfb" class="outline-4">
<h4 id="org6102bfb"><span class="section-number-4">6.3.3.</span> s - precalculated sine wave</h4>
<div class="outline-text-4" id="text-6-3-3">
<p>
Press <code>s</code> to copy the precalculated sine wave to Source A.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-org3598ca7" class="outline-2">
<h2 id="org3598ca7"><span class="section-number-2">7.</span> File Menu</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org60ff46e" class="outline-3">
<h3 id="org60ff46e"><span class="section-number-3">7.1.</span> (l)oad, (m)erge, and (i)mport</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Medley Sound editor is able to load its own project format PVMS as
well as SMUS/IFF song data. The third supported format is raw sample
data encapsulated in a <code>HUNK_UNIT</code> file.
</p>

<p>
<b>Warning!</b> Loading will destroy your current project, even if you're
loading just a sample!  Use Merge or Import to load a sample into your
existing project!
</p>

<p>
The difference between Merge and Import is that Merge will silently
merge a complete PVMS project into the current one.  Import will query
what content is to be imported.
</p>
</div>
</div>


<div id="outline-container-orgc043851" class="outline-3">
<h3 id="orgc043851"><span class="section-number-3">7.2.</span> (s)ave</h3>
<div class="outline-text-3" id="text-7-2">
<p>
This function saves the current project into a PVMS file.  The editor
is not directly able to save to Medley Sound Object (MSOB) format.
</p>
</div>
</div>
