msed-manual.org
** <a>ssembly

This function is used to export the current project in memory into an
assembly source code which can be assembled into a Medley Sound
Object, and then linked into an executable.

The option menu is navigated with numpad arrow keys and options can be
changed by pressing return.  To produce the smallest possible MSOB,
set options to strip names and partial tables.

Asm68k available on Aminet has been tested to produce an object
readable by the standalone Medley Sound Player msplay, even if it
complains about a comment as two undefined identifiers, "future" and
"expansion".

Keep in mind that the implementation of UDATA is broken in msplay!


** (C)lear

This functions frees all allocated working memory.


* msed patches

In addition to missing features msed does have plenty of bugs in it.
This section describes patches to fix functionality that may corrupt
memory.

In the following sections you'll see quote blocks like this

: xxyy : 00 11 22 33

in which ~xxyy~ is the offset from the start of the ~msed~ executable.
The following hexadecimal numbers indicate the content starting from
the specified offset.  The modifications can be done with a hex editor.


** Track editor: semitone up

The upper boundary of "semitone up" is too high and allows turning a
note into a track end marker.

Replace

: 4a48 : 0c 10 00 7f        cmpi.b  #0x7f,(A0)

with

: 4a48 : 0c 10 00 7e        cmpi.b  #0x7e,(A0)

The above fix will change the check to compare against the penultimate
possible note value instead of the last one.  The following
conditional branch instruction (bhi) will skip the next addition
instruction only if the byte value (note or SCODE) at A0 is higher.


** Supervisor: optimise scores

The score optimiser has a bug which may cause the score table scan to
end prematurely.

To make sure the whole score table is scanned, replace

: 6ade : 70 00              moveq      #0x0,D0

with 

: 6ade : 74 00              moveq      #0x0,D2

The patch above initialises the register D2 used as a counter instead
of the scratch buffer register D0.  The pointers loaded to D0 will
replace all the bits in each case, which means that initial clearing
of the register isn't required.
