msed-manual.html


<div id="outline-container-org2f12a75" class="outline-3">
<h3 id="org2f12a75"><span class="section-number-3">7.3.</span> &lt;a&gt;ssembly</h3>
<div class="outline-text-3" id="text-7-3">
<p>
This function is used to export the current project in memory into an
assembly source code which can be assembled into a Medley Sound
Object, and then linked into an executable.
</p>

<p>
The option menu is navigated with numpad arrow keys and options can be
changed by pressing return.  To produce the smallest possible MSOB,
set options to strip names and partial tables.
</p>

<p>
Asm68k available on Aminet has been tested to produce an object
readable by the standalone Medley Sound Player msplay, even if it
complains about a comment as two undefined identifiers, "future" and
"expansion".
</p>

<p>
Keep in mind that the implementation of UDATA is broken in msplay!
</p>
</div>
</div>


<div id="outline-container-org6caf9bf" class="outline-3">
<h3 id="org6caf9bf"><span class="section-number-3">7.4.</span> (C)lear</h3>
<div class="outline-text-3" id="text-7-4">
<p>
This functions frees all allocated working memory.
</p>
</div>
</div>
</div>


<div id="outline-container-orgda83f36" class="outline-2">
<h2 id="orgda83f36"><span class="section-number-2">8.</span> msed patches</h2>
<div class="outline-text-2" id="text-8">
<p>
In addition to missing features msed does have plenty of bugs in it.
This section describes patches to fix functionality that may corrupt
memory.
</p>

<p>
In the following sections you'll see quote blocks like this
</p>

<pre class="example">
xxyy : 00 11 22 33
</pre>


<p>
in which <code>xxyy</code> is the offset from the start of the <code>msed</code> executable.
The following hexadecimal numbers indicate the content starting from
the specified offset.  The modifications can be done with a hex editor.
</p>
</div>


<div id="outline-container-org217a817" class="outline-3">
<h3 id="org217a817"><span class="section-number-3">8.1.</span> Track editor: semitone up</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The upper boundary of "semitone up" is too high and allows turning a
note into a track end marker.
</p>

<p>
Replace
</p>

<pre class="example">
4a48 : 0c 10 00 7f        cmpi.b  #0x7f,(A0)
</pre>


<p>
with
</p>

<pre class="example">
4a48 : 0c 10 00 7e        cmpi.b  #0x7e,(A0)
</pre>


<p>
The above fix will change the check to compare against the penultimate
possible note value instead of the last one.  The following
conditional branch instruction (bhi) will skip the next addition
instruction only if the byte value (note or SCODE) at A0 is higher.
</p>
</div>
</div>


<div id="outline-container-org2b9c596" class="outline-3">
<h3 id="org2b9c596"><span class="section-number-3">8.2.</span> Supervisor: optimise scores</h3>
<div class="outline-text-3" id="text-8-2">
<p>
The score optimiser has a bug which may cause the score table scan to
end prematurely.
</p>

<p>
To make sure the whole score table is scanned, replace
</p>

<pre class="example">
6ade : 70 00              moveq      #0x0,D0
</pre>


<p>
with 
</p>

<pre class="example">
6ade : 74 00              moveq      #0x0,D2
</pre>


<p>
The patch above initialises the register D2 used as a counter instead
of the scratch buffer register D0.  The pointers loaded to D0 will
replace all the bits in each case, which means that initial clearing
of the register isn't required.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lauri "Archyx" Lindholm</p>
<p class="date">Created: 2024-07-14 Sun 15:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
